#include <ansi.h>
int give_gift();
mixed *story =
({
    "且說泥潭準備召開迎新大會，專門指派能歌善舞的精意山莊負責",
    "重頭演出事宜，狂風接到標有"HIR"“王者歸來文化教育部禮儀司”"NOR + WHT,
    "的紅頭文件，立刻緊張起來，雖然精意山莊現成的劇本不少，且",
    "一應俱全，《陽春白雪》與《泰坦尼克》齊飛，《阿甘正傳》共",
    "《脫衣舞娘》一色。但是都已經被看的不勝其煩，沒有新意了。",
    "藍芷萍急得在房子裡走來走去，把毛巾往腦袋上纏出一個大球，作",
    "“絞盡腦汁”狀，但還是沒有一點主意。",
    "繆斯看了不忍，於是對維納斯說：“你看那個人，雖然是笨了點，",
    "不過還是很用心的嘛！還是我們舞蹈藝術的積極分子嘛，是值得培",
    "養的優秀人才，是偉大的藝術事業的接班人嘛……",
    "？？？維納斯一臉疑惑的看著繆斯。",
    "“所以我認為，為了把他們的這次演出搞好，我們應該幫幫忙才對。",
    "你不是想把我們的舞蹈秘籍《七寶天嵐舞》送給她們吧？",
    "“是啊！”",
    "“需要嗎？”",
    "“不需要嗎？”",
    "“需要嗎？”",
    "“不需要嗎？”",
    "………………",
    "於是一個要給，一個不給，兩個人開始爭搶，一不小心，書掉下去了。",
    (: give_gift :)
});

void create() {
    seteuid(getuid());
}

mixed query_story_message(int step) {
    return step < sizeof(story) ? story[step] : 0;
}

int give_gift() {
    STORY_D->give_gift("/task/story/stormdance_book", 1,
        HIM "\n一本裝潢華美的"NOR + YEL"《七寶天嵐舞》"HIM"掉了下來，你\n"
        "耳邊感受到一陣呼呼的風聲。\n\n" NOR);
    return 0;
}
