#include <ansi.h>
int give_gift();
mixed *story = 
({
        "某天，茅山練功場。",
        "南賢正在參詳《降魔道法》之《遁甲天書》，剛好看到《地遁》一節。",
        "看後自言自語：“實踐是檢驗真理的唯一標準，恩，我得嘗試一下才行。",
        "於是南賢開始念起《地遁》，口中唸唸有詞，身體慢慢虛化……",
        "只覺一陣金光撲面，耳邊呼呼作響，發覺自己早已穿山越嶺，飄飄然有",
        "些天人合一的感覺。",
        "如此這般遁了半天，終於累了，想起回茅山休息，總覺得少了點什麼，",
        (: give_gift :),
        "但是玩的太開心了，一時想不起來，於是想：“管他呢，先睡覺再說。”",
        "一覺醒來，又想起玩先前的遊戲，但是突然把咒語忘記了，找來找去，",
        "終於發現原來是《降魔道法》不見了……",
        "南賢對著空氣忿忿地踢了一腳。",
        "凌雲匾上立刻多了一張告示：“由於本人貪玩，不慎在穿山越嶺時丟失",
        "《降魔道法》一本，有拾到者請迅速交還。感激不盡。”",
        "“拜託啦，沒書玩，這兩天可悶的慌啊……”",
});

void create()
{
        seteuid(getuid());
}

mixed query_story_message(int step)
{
        return step < sizeof(story) ? story[step] : 0;
}

int give_gift()
{
        STORY_D->give_gift("/task/story/xmdaofa", 1,
                           HIM "\n你忽然覺得腳底一陣翻動，低頭一看，地裡冒出一本"HIG"《降魔道法》"HIM"！\n\n" NOR);
        return 1;
}
