#include <ansi.h>
int give_gift();
mixed *story =
({
    "話說岳靈珊心血來潮想練棍法，找來找去找不到短棍，忽然想起一件東西，",
    "…………",
    "令狐沖和盈盈幽會回來，心情特別好，走進房間想找簫吹奏一曲，結果找不",
    "到，最後在練功房找到了已經身首異處的簫。",
    "令狐沖一肚子的火，仰天長嘯：“誰……誰幹的？站……站出來！！！",
    "嶽靈珊跳過來，叉著腰說：”是我啊，你能把我怎麼著？”",
    "令狐沖：你想要呀？你想要說清楚了就行了嘛，你想要我會給你的，你想要",
    "        我當然不會不給你了。不可能你說要我不給你，你說不要我卻偏要",
    "        給你。大家講道理嘛……",
    "令狐沖越說越激動，聲調也越來越高……",
    "話說lonely正在QQ上和一個ppmm聊天，正聊得起勁，被令狐沖吵得昏頭漲腦，",
    "實在不勝其煩，大叫一聲：”我Kao！不就是一隻簫嗎，我再給你一支就是了！",
    "只見lonely伸手凌空一指，變出了"CYN"玉簫"WHT"。隨手一扔，又忙著去找他的mm了",
    (: give_gift :),
    "令狐沖等了半天，還是沒有：“奇怪，怎麼老半天了連簫的影子都沒有？”",
    "遠遠的傳來lonely的聲音：“笨蛋，自己去找！”",
    "令狐沖“唉”的嘆了一口氣：“這世道，什麼事都會發生……”"
});

void create() {
    seteuid(getuid());
}

mixed query_story_message(int step) {
    return step < sizeof(story) ? story[step] : 0;
}

int give_gift() {
    STORY_D->give_gift("/task/story/yu_xiao", 1,
        HIM "\n一支"NOR + CYN"玉簫"HIM"掉到你頭上，砸出一個大包。\n\n" NOR);
    return 1;
}
