#include <ansi.h>
inherit ROOM;
string *long_desc = ({
"點蒼山雲弄、滄浪峰。此兩峰相連，險峻崢嶸。峰上雲霧環繞，有
如仙境。山峰間夾一條山溪，名“霞移”，溪水清碧，涓涓流淌。\n",

"點蒼山五臺、蓮花峰。此兩峰相連，險峻崢嶸。峰上怪石林立，且
又各具形態。山峰間一條山溪，名曰“萬花”，溪水清碧，涓涓流淌。\n",

"點蒼山滄浪、五臺峰。此兩峰一高一矮，相依成景。峰上林木繁多，
霧氣翻騰，宛如滄海。山峰間一瀑飛落，乃是“陽溪”，其水甘甜如泉卻
又冷似冰雪。\n",

"點蒼山蓮花、白雲峰。此兩峰峰勢不雄，但卻秀麗無比。峰上花木
成林，紅綠相間，一片春色。山峰間“茫湧”溪水色如碧玉，隨著山勢緩
緩流淌。\n",

"點蒼山白雲、鶴雲峰。白雲低而鶴雲高，遠遠望去，有如一隻仙鶴
矗立於茫茫雲海之中。“錦溪”從峰間流過，載起飛花、落葉，宛如一根
凌空飛舞的彩雲絲帶。\n",

"點蒼山鶴雲、三陽峰。一峰高聳有如仙鶴，一峰壯闊有如海濤。溪
水流過，形似靈蛇，盤旋於兩峰之間，不急不緩，正是“靈泉”名渠。\n",
});
void create()
{
        string msg = long_desc[random(sizeof(long_desc))];
        set("short", GRN"點蒼十九峰"NOR);
        set("long", msg);
        set("resource/water", 1);
        set("outdoors", "dali");

        set("exits", ([
                "north" : __DIR__"ylf1",
            "southdown" : __DIR__"dc2",              
        ]));

        set("coor/x",-350);
  set("coor/y",-410);
   set("coor/z",20);
   setup();
}