#include <ansi.h>

#define DB_D          "/adm/daemons/dbd"
#define DIALOG_D      "/adm/daemons/dialogd"
#define SUICONG_D     "/adm/daemons/suicongd"
#define SKYBOOK_D     "/adm/daemons/skybookd"
#define FUBEN_D       "/adm/daemons/fuben_daemonsd"

#define DEBOOKS "笑傲江湖"


inherit ITEM;

// 序章開始時調用的劇情簡介
string *sBookMsg = ({
        "其時武林之中，既有正邪之判，復存門戶之別，少林、武當、青城、五嶽自詡正教與魔教（日月神教）冤冤相報，誓不兩立。",
        "五嶽劍派名雖一體，實存芥蒂。嵩山掌門左冷禪野心勃勃，意欲吞併五嶽，稱霸江湖，自恃盟主身份，凌駕四嶽掌門，挑撥華山劍宗爭奪掌門之位。",
        "嶽不群原屬氣宗，劍、氣二宗素不相和，不群率本門弟子外出避禍，遭左道之士埋伏，俱被擒獲。",
        "江湖之中流傳著一個傳說，林家祖傳的《辟邪劍法》乃天下無敵之武功，誰能練成將天下無敵！",
        "福建林遠圖以七十二路辟邪劍法稱雄武林，創立福威鏢局，笑傲江湖，馳騁天下。",
        "遠圖死後，子孫無能，四方豪傑覬覦辟邪劍譜，紛至沓來 ……",
        "辟邪劍譜之爭，武林盟主之爭，由此拉開序幕！",
});

mapping mSkybook_fuben = ([
        "任務編號數字"   :   "章節名:副本名:故事描述:linghuchong:令狐沖:氣血1-氣血2-氣血3:攻擊力1-攻擊力2-攻擊力3:防禦力1-防禦力2-防禦力3:dugu-jiujian:等級1-等級2-等級3:兵器類型:5:BOSS性別", 
                                // 章節名:副本名:副本描述:BOSS文件名:BOSS中文名:三個難度的氣血:三個難度的攻擊:三個難度的防禦:主要攻擊技能:三個難度的技能等級:兵器類型:下一個任務編號:性別
                                // 兵器類型為sword, blade,pin等標準定義，也可填寫strike, hand
"1":"第一章:路見不平:青城派弟子欺辱一個文弱公子，你路見不平，拔刀相助。:xajh1:青城派弟子:25000000-50000000-100000000:25000-50000-75000:25000-60000-100000:cuixin-zhang:500:strike:5:男性",
"5":"第一章:青城四少:青城派弟子帶來了幫手，傳說中的青城四少，看樣子你不得不動武了。:xajh5:青城四少:27500000-55000000-110000000:27500-55000-82500:27500-66000-110000:cuixin-zhang:550:strike:10:男性",
"10":"第一章:變臉:原來你搭救的是福威鏢局的少東家林平之，惹怒了青城派掌門人餘滄海，據說他會變臉，不好對付。:xajh10:餘滄海:30000000-60000000-120000000:30000-60000-90000:30000-72000-120000:cuixin-zhang:600:strike:15:男性",
"15":"第一章:滅門1:林家被滅門，僅林平之逃出，但是被青城派一路追殺。:xajh15:青城派堂主:32500000-65000000-130000000:32500-65000-97500:32500-78000-130000:cuixin-zhang:650:strike:20:男性",
"20":"第一章:滅門2:林家被滅門，僅林平之逃出，但是被青城派一路追殺。:xajh20:餘人傑:35000000-70000000-140000000:35000-70000-105000:35000-84000-140000:cuixin-zhang:700:strike:25:男性",
"25":"第一章:滅門3:林家被滅門，僅林平之逃出，但是被青城派一路追殺。:xajh25:平沙落雁:37500000-75000000-150000000:37500-75000-112500:37500-90000-150000:cuixin-zhang:750:strike:30:男性",
"30":"第一章:誤會1:救出林平之，被華山派弟子誤會，打了起來。:xajh30:勞德諾:40000000-80000000-160000000:40000-80000-120000:40000-96000-160000:hunyuan-zhang:800:strike:35:男性",
"35":"第一章:誤會2:聽說其中一位叫令狐沖的是華山派大弟子，想和你切磋切磋。:xajh35:令狐沖:42500000-85000000-170000000:42500-85000-127500:42500-102000-170000:huashan-jian:850:sword:40:男性",
"40":"第一章:瀟湘夜雨:一陣琴音飄來，一位老者似乎路見不平，向你發起挑戰。:xajh40:莫大:45000000-90000000-180000000:45000-90000-135000:45000-108000-180000:shilin-jian:900:sword:45:男性",
"45":"第一章:採花大盜:聽說衡陽劉正風金盆洗手打會甚是熱鬧，你在前往的路上遇到傳說中的採花賊田伯光，一句不和跟他打了起來。:xajh45:田伯光:47500000-95000000-190000000:47500-95000-142500:47500-114000-190000:kuangfeng-blade:950:blade:50:男性",
"50":"第一章:塞北明駝:金盆洗手大會上，塞北明駝木高峰咄咄逼人，得教訓教訓他了。:xajh50:木高峰:50000000-100000000-200000000:50000-100000-150000:50000-120000-200000:luohan-quan:1000:cuff:55:男性",
"55":"第一章:滄海桑田:青城派餘滄海顯然對你不滿至極，想在今日了結你們的恩怨。:xajh55:餘滄海:52500000-105000000-210000000:52500-105000-157500:52500-126000-210000:cuixin-zhang:1050:strike:60:男性",
"60":"第二章:金盆洗手1:嵩山派費斌奉盟主左冷禪之命，阻撓劉正風金盆洗手。:xajh60:費斌:55000000-110000000-220000000:55000-110000-165000:55000-132000-220000:songyang-zhang:1100:strike:65:男性",
"65":"第二章:金盆洗手2:嵩山派丁勉奉盟主左冷禪之命，阻撓劉正風金盆洗手。:xajh65:丁勉:57500000-115000000-230000000:57500-115000-172500:57500-138000-230000:yinyang-zhang:1150:strike:70:男性",
"70":"第二章:金盆洗手3:嵩山派陸柏奉盟主左冷禪之命，阻撓劉正風金盆洗手。:xajh70:陸柏:60000000-120000000-240000000:60000-120000-180000:60000-144000-240000:yinyang-zhang:1200:strike:75:男性",
"75":"第二章:曲譜:劉正風和曲洋對你的相救之恩萬分感激，將《笑傲江湖》曲譜贈送與你。無奈又遇到費斌趕來追殺，最終二人自刎以嘲笑天下。:xajh75:費斌:62500000-125000000-250000000:62500-125000-187500:62500-150000-250000:songyang-zhang:1250:strike:80:男性",
"80":"第二章:贈譜:你見《笑傲江湖》曲譜轉送給令狐沖。路遇嶽不群視你為魔教，向你發動攻勢。:xajh80:嶽不群:65000000-130000000-260000000:65000-130000-195000:65000-156000-260000:hunyuan-zhang:1300:strike:85:男性",
"85":"第二章:面壁:令狐沖被你牽連，嶽不群罰他去華山後山面壁一年，你前往探望，路遇採花大盜田伯光……:xajh85:田伯光:67500000-135000000-270000000:67500-135000-202500:67500-162000-270000:kuangfeng-blade:1350:blade:90:男性",
"90":"第三章:神劍出竅:華山後山，遇風清揚指導武學，切磋一番。:xajh90:風清揚:73500000-147000000-294000000:73500-147000-220500:73500-176400-294000:dugu-jiujian:1470:sword:95:男性",
"95":"第三章:六個仙人:從華山下山後，遇到六個怪人，自稱是仙，對你百般阻撓，無奈之下只能動武。:xajh95:桃谷六仙:79500000-159000000-318000000:79500-159000-238500:79500-190800-318000:taiji-quan:1590:unarmed:100:男性",
"100":"第三章:胖和尚:胖和尚誤認為你是採花大盜，說什麼都不讓你離開華山。:xajh100:不戒和尚:85500000-171000000-342000000:85500-171000-256500:85500-205200-342000:xianglong-zhang:1710:strike:105:男性",
"105":"第三章:大戰方生:前面之事誤會太多，江湖中人都誤認你為魔教黨羽，少林派對你也不罷休。:xajh105:方生大師:91500000-183000000-366000000:91500-183000-274500:91500-219600-366000:qianye-shou:1830:hand:110:男性",
"110":"第三章:天王老子:出得少林，路遇眾人追擊魔教長老，你出手相助決定除掉魔教中人，以正名聲。:xajh110:向問天:97500000-195000000-390000000:97500-195000-292500:97500-234000-390000:qingmang-zhang:1950:strike:115:男性",
"115":"第三章:不打不相識:原來此長老是魔教護法向問天，為人豪爽，眾人以多欺少，反倒令你心生厭惡，決定助向問天脫險:xajh115:向問天仇家:103500000-207000000-414000000:103500-207000-310500:103500-248400-414000:chousui-zhang:2070:strike:120:男性",
"120":"第四章:獨戰群雄1:群雄見你幫向問天，決定先剷除你而後快。青城派侯人雄率先發難。:xajh120:侯人雄:109500000-219000000-438000000:109500-219000-328500:109500-262800-438000:cuixin-zhang:2190:strike:125:男性",
"125":"第四章:獨戰群雄2:原來向問天也得罪了魔教，魔教八雄齊上。:xajh125:魔教八雄:115500000-231000000-462000000:115500-231000-346500:115500-277200-462000:cuixin-zhang:2310:strike:130:男性",
"130":"第四章:獨戰群雄3:泰山派天乙道人出手，向你攻了過來。:xajh130:天乙道人:121500000-243000000-486000000:121500-243000-364500:121500-291600-486000:taiji-jian:2430:sword:135:男性",
"135":"第四章:獨戰群雄4:嵩山大陰陽手樂厚從背後偷襲你，小心！:xajh135:樂厚:127500000-255000000-510000000:127500-255000-382500:127500-306000-510000:yinyang-zhang:2550:strike:140:男性",
"140":"第四章:梅莊救人1:一輪惡戰結束後，你答應跟向問天前往梅莊營救神秘人物。:xajh140:丹青生:133500000-267000000-534000000:133500-267000-400500:133500-320400-534000:jidian-jian:2670:sword:145:男性",
"145":"第四章:梅莊救人2:一輪惡戰結束後，你答應跟向問天前往梅莊營救神秘人物。:xajh145:禿筆翁:139500000-279000000-558000000:139500-279000-418500:139500-334800-558000:pomopima-jian:2790:sword:150:男性",
"150":"第四章:梅莊救人3:一輪惡戰結束後，你答應跟向問天前往梅莊營救神秘人物。:xajh150:黑白子:145500000-291000000-582000000:145500-291000-436500:145500-349200-582000:xuantian-zhi:2910:finger:155:男性",
"155":"第四章:梅莊救人4:一輪惡戰結束後，你答應跟向問天前往梅莊營救神秘人物。:xajh155:黃鐘公:151500000-303000000-606000000:151500-303000-454500:151500-363600-606000:qixian-wuxingjian:3030:sword:160:男性",
"160":"第四章:梅莊救人5:一輪惡戰結束後，你答應跟向問天前往梅莊營救神秘人物。:xajh160:受傷的任我行:157500000-315000000-630000000:157500-315000-472500:157500-378000-630000:yuanshi-jian:3150:sword:165:男性",
"165":"第四章:梅莊救人6:東方不敗派人來查，事情敗露，不得不戰。:xajh165:秦偉邦:163500000-327000000-654000000:163500-327000-490500:163500-392400-654000:zhenyu-quan:3270:cuff:170:男性",
"170":"第五章:日月神教1:與任我行，向問天及任盈盈前往日月神教誅殺東方不敗。:xajh170:鮑大楚:169500000-339000000-678000000:169500-339000-508500:169500-406800-678000:zhenyu-quan:3390:cuff:175:男性",
"175":"第五章:日月神教2:與任我行，向問天及任盈盈前往日月神教誅殺東方不敗。:xajh175:魔教長老:175500000-351000000-702000000:175500-351000-526500:175500-421200-702000:zhenyu-quan:3510:cuff:180:男性",
"180":"第五章:日月神教3:與任我行，向問天及任盈盈前往日月神教誅殺東方不敗。:xajh180:魔教護法:181500000-363000000-726000000:181500-363000-544500:181500-435600-726000:zhenyu-quan:3630:cuff:185:男性",
"185":"第五章:日月神教4:與任我行，向問天及任盈盈前往日月神教誅殺東方不敗。:xajh185:楊蓮亭:187500000-375000000-750000000:187500-375000-562500:187500-450000-750000:qixian-wuxingjian:3750:sword:190:男性",
"190":"第五章:日月神教5:與任我行，向問天及任盈盈前往日月神教誅殺東方不敗。:xajh190:東方不敗:193500000-387000000-774000000:193500-387000-580500:193500-464400-774000:kuihua-mogong:3870:finger:195:無性",
"195":"第五章:營救聖姑1:任盈盈被少林寺軟禁，前往營救。:xajh195:桃谷六仙:199500000-399000000-798000000:199500-399000-598500:199500-478800-798000:kongming-quan:3990:unarmed:200:男性",
"200":"第五章:營救聖姑2:任盈盈被少林寺軟禁，前往營救。:xajh200:沖虛道長:205500000-411000000-822000000:205500-411000-616500:205500-493200-822000:taiji-quan:4110:unarmed:205:男性",
"205":"第五章:營救聖姑3:任盈盈被少林寺軟禁，前往營救。:xajh205:方生大師:211500000-423000000-846000000:211500-423000-634500:211500-507600-846000:qianye-shou:4230:hand:210:男性",
"210":"第五章:營救聖姑4:任盈盈被少林寺軟禁，前往營救。:xajh210:餘滄海:217500000-435000000-870000000:217500-435000-652500:217500-522000-870000:cuixin-zhang:4350:strike:215:男性",
"215":"第五章:營救聖姑5:任盈盈被少林寺軟禁，前往營救。:xajh215:左冷禪:223500000-447000000-894000000:223500-447000-670500:223500-536400-894000:hanbing-zhang:4470:strike:220:男性",
"220":"第五章:營救聖姑6:任盈盈被少林寺軟禁，前往營救。:xajh220:方證大師:229500000-459000000-918000000:229500-459000-688500:229500-550800-918000:qianye-shou:4590:hand:225:男性",
"225":"第六章:華山大戰1:協助令狐沖返回華山派，不料偶遇一場大戰。:xajh225:封不平:235500000-471000000-942000000:235500-471000-706500:235500-565200-942000:huashan-jian:4710:sword:230:男性",
"230":"第六章:華山大戰2:協助令狐沖返回華山派，不料偶遇一場大戰。:xajh230:成不憂:241500000-483000000-966000000:241500-483000-724500:241500-579600-966000:huashan-jian:4830:sword:235:男性",
"235":"第六章:華山大戰3:協助令狐沖返回華山派，不料偶遇一場大戰。:xajh235:嶽不群:247500000-495000000-990000000:247500-495000-742500:247500-594000-990000:hunyuan-zhang:4950:strike:240:男性",
"240":"第六章:華山大戰4:協助令狐沖返回華山派，不料偶遇一場大戰。:xajh240:大力神魔範松:253500000-507000000-1014000000:253500-507000-760500:253500-608400-1014000:zhenyu-quan:5070:cuff:245:男性",
"245":"第六章:華山大戰5:協助令狐沖返回華山派，不料偶遇一場大戰。:xajh245:金猴神魔張乘風:263500000-527000000-1054000000:263500-527000-790500:263500-632400-1054000:zhenyu-quan:5270:cuff:250:男性",
"250":"第六章:華山大戰6:協助令狐沖返回華山派，不料偶遇一場大戰。:xajh250:白猿神魔張乘雲:273500000-547000000-1094000000:273500-547000-820500:273500-656400-1094000:zhenyu-quan:5470:cuff:255:男性",
"255":"第七章:五嶽會戰1:五嶽派推舉盟主，勝者為王。武林盟主你勢在必得！:xajh255:玉璣子:283500000-567000000-1134000000:283500-567000-850500:283500-680400-1134000:taishan-sword:5670:sword:260:男性",
"260":"第七章:五嶽會戰2:五嶽派推舉盟主，勝者為王。武林盟主你勢在必得！:xajh260:莫大:293500000-587000000-1174000000:293500-587000-880500:293500-704400-1174000:shilin-jian:5870:sword:265:男性",
"265":"第七章:五嶽會戰3:五嶽派推舉盟主，勝者為王。武林盟主你勢在必得！:xajh265:定閒師太:303500000-607000000-1214000000:303500-607000-910500:303500-728400-1214000:hengshan-jian:6070:sword:270:女性",
"270":"第七章:五嶽會戰4:五嶽派推舉盟主，勝者為王。武林盟主你勢在必得！:xajh270:嶽不群:313500000-627000000-1254000000:313500-627000-940500:313500-752400-1254000:pixie-jian:6270:sword:275:男性",
"275":"第七章:五嶽會戰5:五嶽派推舉盟主，勝者為王。武林盟主你勢在必得！:xajh275:左冷禪:323500000-647000000-1294000000:323500-647000-970500:323500-776400-1294000:hanbing-zhang:6470:strike:280:男性",
"280":"第七章:五嶽會戰6:五嶽派推舉盟主，勝者為王。武林盟主你勢在必得！:xajh280:任盈盈:333500000-667000000-1334000000:333500-667000-1000500:333500-800400-1334000:lansha-shou:6670:hand:285:女性",
"285":"第七章:五嶽會戰7:五嶽派推舉盟主，勝者為王。武林盟主你勢在必得！:xajh285:令狐沖:343500000-687000000-1374000000:343500-687000-1030500:343500-824400-1374000:dugu-jiujian:6870:sword:290:男性",
"290":"第七章:五嶽會戰8:五嶽派推舉盟主，勝者為王。武林盟主你勢在必得！:xajh290:方證大師:353500000-707000000-1414000000:353500-707000-1060500:353500-848400-1414000:qianye-shou:7070:hand:295:男性",
"295":"第八章:決戰1:你拒絕加入日月神教，決戰的時候到了。:xajh295:上官雲:363500000-727000000-1454000000:363500-727000-1090500:363500-872400-1454000:qingmang-zhang:7270:strike:300:男性",
"300":"第八章:決戰2:你拒絕加入日月神教，決戰的時候到了。:xajh300:鮑大楚:373500000-747000000-1494000000:373500-747000-1120500:373500-896400-1494000:qingmang-zhang:7470:strike:305:男性",
"305":"第八章:決戰3:你拒絕加入日月神教，決戰的時候到了。:xajh305:童百熊:383500000-767000000-1534000000:383500-767000-1150500:383500-920400-1534000:qingmang-zhang:7670:strike:310:男性",
"310":"第八章:決戰4:你拒絕加入日月神教，決戰的時候到了。:xajh310:向問天:393500000-787000000-1574000000:393500-787000-1180500:393500-944400-1574000:qingmang-zhang:7870:strike:315:男性",
"315":"第八章:決戰5:你拒絕加入日月神教，決戰的時候到了。:xajh315:任盈盈:403500000-807000000-1614000000:403500-807000-1210500:403500-968400-1614000:lansha-shou:8070:hand:320:女性",
"320":"第八章:決戰6:你拒絕加入日月神教，決戰的時候到了。:xajh320:任我行:413500000-827000000-1654000000:413500-827000-1240500:413500-992400-1654000:yuanshi-jian:8270:sword:325:男性",
"325":"第九章:歸隱1:你看淡江湖，決心歸隱，不再笑傲江湖，最後的一戰在所難免。:xajh325:左冷禪:423500000-847000000-1694000000:423500-847000-1270500:423500-1016400-1694000:hanbing-zhang:8470:strike:330:男性",
"330":"第九章:歸隱2:你看淡江湖，決心歸隱，不再笑傲江湖，最後的一戰在所難免。:xajh330:桃谷六仙:433500000-867000000-1734000000:433500-867000-1300500:433500-1040400-1734000:taiji-quan:8670:unarmed:335:男性",
"335":"第九章:歸隱3:你看淡江湖，決心歸隱，不再笑傲江湖，最後的一戰在所難免。:xajh335:嶽不群:443500000-887000000-1774000000:443500-887000-1330500:443500-1064400-1774000:pixie-jian:8870:sword:340:無性",
"340":"第九章:歸隱4:你看淡江湖，決心歸隱，不再笑傲江湖，最後的一戰在所難免。:xajh340:林平之:453500000-907000000-1814000000:453500-907000-1360500:453500-1088400-1814000:pixie-jian:9070:sword:345:無性",
"345":"第九章:歸隱5:你看淡江湖，決心歸隱，不再笑傲江湖，最後的一戰在所難免。:xajh345:紅葉禪師:463500000-927000000-1854000000:463500-927000-1390500:463500-1112400-1854000:pixie-jian:9270:sword:350:無性",
"350":"第九章:歸隱6:你看淡江湖，決心歸隱，不再笑傲江湖，最後的一戰在所難免。:xajh350:令狐沖:500000000-1000000000-2000000000:500000-1000000-1500000:500000-1200000-2000000:dugu-jiujian:10000:sword:9999:男性",

 "9999"  : "大結局:0:0:0:0:0:0:0:0:0:0:0:0",
]);


public get_mSkybook_fuben(string sQuest, int flag)
{
                string *keys_info;
                
                keys_info = explode(mSkybook_fuben[sQuest], ":");
                
                return keys_info[flag];
}

// 獲取副本的最快記錄
string get_record(string sQuest)
{
                string sName, sId;
                int nKilltime;
                
                nKilltime = DB_D->query_data("skybook/record/通關時間記錄/" + DEBOOKS + "/" + sQuest + "/time");
                sName = DB_D->query_data("skybook/record/通關時間記錄/" + DEBOOKS + "/" + sQuest + "/name");
                sId = DB_D->query_data("skybook/record/通關時間記錄/" + DEBOOKS + "/" + sQuest + "/id");
                
                if (nKilltime == 0)return "暫無記錄";
                        
                return sprintf("%d", nKilltime) + "秒，由 " + sName + "(" + sId + ") 創造"; 
}

void create()
{
        set_name("天書", ({ "skybook_xiaoaojianghu" }));
        if (clonep())
                set_default_object(__FILE__);
        else {
                set("value", 0);
                set_weight(0);
        }
        setup();
}

// 移動到劇情副本，flag代表任務編號
void move_to_room(object me, string nQuest)
{
        object obroom;
        int nKey;
        object ob;
        string sQuestInfo, *keys_QuestInfo, sNandu, *sTemp;
        string sID,sGender, sName, sHp, sDamage, sDefense, sSkill, sSkLevel, sType, sNextQuest;
        int nHp, nDamage, nDefense, nSkLevel;
        
        obroom = new("/clone/skybook14/sky14room");
        obroom->set("books", DEBOOKS);
        obroom->set("create_time", time());
        
        sNandu = me->query("skybook14/" + obroom->query("books") + "/難度");
        
        sQuestInfo = mSkybook_fuben[nQuest];
        keys_QuestInfo = explode(sQuestInfo, ":");
        
        // 根據配置設置房間名字和描述
        obroom->set_name(HIG + keys_QuestInfo[0] + "-" + keys_QuestInfo[1] + HIC + "(最快記錄：" + get_record(nQuest) + ")", ({ "skybook" + sprintf("%d", time() + random(10)) }));
        obroom->set("long", keys_QuestInfo[2] + "\n");
        
  // 根據配置創建相應的BOSS和屬性
  ob = new("/clone/skybook14/skybooknpc");

  sID = keys_QuestInfo[3];
  sName = keys_QuestInfo[4];
  sHp = keys_QuestInfo[5];
  sDamage = keys_QuestInfo[6];
  sDefense = keys_QuestInfo[7];
  sSkill = keys_QuestInfo[8];
  sSkLevel = keys_QuestInfo[9];
  sType = keys_QuestInfo[10];
  sNextQuest = keys_QuestInfo[11];
        sGender = keys_QuestInfo[12];   
        
  // 根據副本難度需要計算的數據
  if (sNandu == "少俠級")nKey = 0;
  else if (sNandu == "大俠級")nKey = 1;
  else nKey = 2;

  sHp = explode(sHp,"-")[nKey];
        sDamage = explode(sDamage,"-")[nKey];
        sDefense = explode(sDefense,"-")[nKey];
        sscanf(sSkLevel, "%d", nSkLevel);
        sscanf(sHp, "%d", nHp);
        sscanf(sDamage, "%d", nDamage);
        sscanf(sDefense, "%d", nDefense);
        sscanf(sSkLevel, "%d", nSkLevel);
        
        
  
  // 設置BOSS的任務編號及難度
  ob->set("books", obroom->query("books"));
        ob->set("nQuest", nQuest);
        ob->set("sNextQuest", sNextQuest);
        sTemp = explode(mSkybook_fuben[sNextQuest], ":");
        ob->set("sNextQuestZhangjie", sTemp[0]);
        ob->set("sNextQuestTitle", sTemp[1]);
        ob->set("sNandu", sNandu);
  ob->set("me", me);
  ob->set("skybookOBPath", __FILE__);
        ob->set("難度", sNandu);
        ob->set("born_room", obroom);

        ob->move(obroom);
        
        // 初始化BOSS
  ob->init_data(__FILE__,sGender,sID,sName,nHp,nDamage,nDefense,sSkill,nSkLevel,sType, sNandu);
  
        // 設置BOSS生成時間
        ob->set("create_time", time());

        me->move(obroom);
        
}

// 序章對話完畢後調用的回調接口，可以開始處理戰鬥副本開始了
void dialog_end(object me, int flag)
{

        if (! objectp(me))return;

        move_to_room(me, sprintf("%d", flag) );

        return;
}

// 來自 /cmds/usr/skybook.c調用，開始天書任務
void startbook(object me, string sBook)
{
        string sQuest; // 當前任務編號
        string sZhangjie; // 當前章節
        object ob, ob2;

        sZhangjie = me->query("skybook14/" + sBook + "/當前章節");
        sQuest = me->query("skybook14/" + sBook + "/任務編號"); // 表示還沒有完成的任務編號
        

        if (sQuest == "1")
        {
                DIALOG_D->start_dialog4(this_object(), me, sBookMsg, 0, 1);
                return;
        }
        
        
        FUBEN_D->move_all_invalid_user(me);
        
        move_to_room(me, sQuest);

        return;

}

// 副本全部通關，大結局
void endskybook(object me)
{

        // 通知玩家完成了該天書
        tell_object(me, BLINK + HIY "\n恭喜你！成功通關《" + DEBOOKS + "》天書！\n\n" NOR);
        
        // 廣播全服
        CHANNEL_D->do_channel(this_object(),"rumor", "聽說" + HIY + me->query("name")  + "(" + me->query("id") + ")" HIM "闖關《" + DEBOOKS + "》天書成功！\n");
                
        log_file("0通關天書", me->query("id") + " at " + ctime(time()) + " 通關 " + DEBOOKS  + "\n" );
                
        // 累積該完成次數
        me->add("skybook14/option/" + DEBOOKS + "/completed_times", 1);
        
        // 給予通關固定獎勵
        GIFT_D->delay_bonus(me,
                ([ "exp"      : 5000000,
                   "pot"      : 5000000,
                   "mar"      : 5000000,
                   "prompt"   : "你在通關《" +  DEBOOKS + "》天書後" ]), 999);  

        // 給予通關隨機獎勵
        SUICONG_D->give_end_gift(me, DEBOOKS, me->query("skybook14/" + DEBOOKS + "/難度"));

        return;
        
}
