// /adm/daemons/banned_named.c

string *banned_name = ({    // 禁止出現在人名的任何部分
// 巫師的名字
    "叮噹", "阿蘭", "阿飛",

// 系統保留字
    "巫師", "天神", "女巫", "某人",

// 名人的名字
    "毛澤東", "鄧小平", "江澤民", "胡錦濤", "朱鎔基", "錢其琛",
    "李瑞環", "胡耀邦", "趙紫陽", "溫家寶",
    "金庸", "查良鏞",

// 髒話以及敏感字眼
    "日你", "操你", "幹你", "日死", "操死", "乾死", "狗日",
    "我日", "我操", "我幹", "雞巴", "肛門", "性交", "畜生",
    "強姦", "肛交", "法輪功", "插死", "狗娘", "雜種", "自慰",
    "雞姦", "淫蕩", "母狗", "祖宗十八", "媽的個逼", "媽的逼",
    "媽個逼", "媽逼", "逼養的", "小逼", "騷貨", "你媽生",
    "陰道", "陰戶", "陰蒂", "陰莖", "龜頭", "卵蛋", "睪丸",
    "狗娘", "烏龜王八", "傻逼", "輪姦",
    "妓", "娼", "尻", "婊", "屄", "肏", "屌", "屁", "雞",
    "性", "淫", "嫖", "奸", "妓", "爺", "奶",
    "父", "母", "叔", "舅", "爸", "媽", "爹", "娘",
    "老婆", "丈夫", "老公", "妻子", "姘頭",
    "赤佬", "癟三", "傻逼", "蠢蛋", "閹割", "閹人", "裸體", "婊子",
    "統一", "法輪", "吃人", "革命", "反動", "臺獨", "黑客", "駭客",
    "廢物", "低能", "垃圾", "變態", "混蛋", "渾蛋", "白痴", "弱智",
    "國民", "共產", "社會", "自由", "民主", "主義", "人民", "中央",
    "打倒", "反對", "反動", "攻擊", "佔領", "消滅", "攻陷", "搶劫",
    "稱霸", "廣告", "色情", "侮辱", "辱罵", "罵人", "大便",
});

string *novel_name = ({        // 禁止和人名完全匹配

// 次系統保留字
    "孫中山", "孫文", "蔣介石", "林彪", "江青", "朱德",
    "羅榮桓", "陶鑄", "劉伯承", "陳毅", "賀龍", "彭德懷",
    "葉劍英", "毛岸英", "李大釗", "陳獨秀", "葉群", "羅幹",
    "列寧", "斯大林", "馬克思", "恩格斯",
    "陳水扁", "李登輝", "連戰", "李洪志",

// 通用名字 及 通用稱謂
    "將軍", "副將", "參將", "牙將", "武將", "官兵", "兵丁", "士兵",
    "捕頭", "巡捕", "快捕", "鐵捕", "捕快", "衙役", "差役", "官差",
    "太監", "公公", "宦官", "宮女", "侍女", "隨從", "親隨", "夥計",

    "土匪", "強盜", "大盜", "劫匪", "惡霸", "惡棍", "叛徒", "流氓",
    "小土匪", "土匪頭目", "土匪大頭目", "山賊", "小山賊", "倭寇",
    "倭寇頭目", "倭寇大頭目", "流氓頭",

    "藝人", "小二", "跑堂", "窮漢", "乞丐", "雜役", "工頭", "流浪漢",
    "腳伕", "車伕", "挑夫", "馬伕", "轎伕", "漁夫", "民夫", "牧人",
    "莊家", "管家", "店家", "船家", "梢公", "老闆", "掌櫃", "商人",
    "鐵匠", "匠人", "工匠", "裁縫", "農夫", "醫生", "藥師", "採藥人",
    "船伕", "老船伕", "漁翁", "樵夫", "門衛", "仕衛", "侍衛", "小販",

    "豪客", "俠客", "刀客", "劍客", "遊客", "賭客", "刺客", "旅客",
    "拳師", "武師", "鏢師", "保鏢", "打手", "護院", "教頭", "趟子手",
    "忍者", "武士", "殺手",

    "老爺", "夫人", "少爺", "公子", "相公", "書生", "小姐", "太太",
    "丫鬟", "家丁", "僕人", "下人", "小童", "啞僕", "書僮", "使女",
    "女人", "女子", "女的", "女孩", "婦人", "姑娘", "丫頭", "小孩",
    "男人", "男子", "男的", "男孩", "孩子", "小夥", "小子", "孩童",
    "老翁", "老頭", "老者", "老人", "青年", "中年", "壯年", "後生",

    "和尚", "尼姑", "喇嘛", "道士", "沙彌", "上人", "僧人", "行者",
    "禪師", "師太", "尊者", "羅漢", "大師", "比丘", "道長", "道人",
    "師傅", "師父", "師兄", "師弟", "師姐", "師妹", "師叔", "弟子",
    "小喇嘛", "小沙彌", "小乞丐", "老乞丐", "乞丐", "道童",

    "教主", "寨主", "幫主", "舵主", "洞主", "堂主", "門主", "島主",
    "壇主", "掌門", "方丈", "主持", "護法", "龍頭", "長老", "大哥",
    "幫眾", "教眾", "教徒",

// 動物
    "毒蛇", "黑冠巨蟒", "蟒蛇", "金環蛇", "竹葉青蛇", "眼鏡蛇",
    "蝮蛇", "菜花蛇", "小毛驢", "公雞", "大狼狗", "野雞", "野豬",
    "野兔", "鯊魚", "噬人魚", "猴子", "老鼠", "玉蜂", "白兔",
    "狼", "蜜蜂", "小蜜蜂", "烏鴉",
    "黃驃馬", "伊犁馬", "烏騅馬", "鐵甲馬",
    "烏雲蓋雪", "墨蹄玉兔", "汗血寶馬",

// 金庸原著小說人物
    // A
    "鰲拜", "敖彪",
    "安健剛", "安提督", "安奉日", "安大娘", "安劍清", "安小慧",
    "阿濟赤", "阿爾尼", "阿凡提", "阿里", "阿曼", "阿大", "阿二", "阿三",
    "阿紫", "阿朱", "阿珂", "阿秀", "阿九", "阿碧", "阿洪", "阿勝", "阿根",

    // B
    "巴泰", "巴天石", "巴郎星", "巴顏法師",
    "白自在", "白萬劍", "白龜壽", "白振", "白世鏡", "白寒松", "白寒楓",
    "白阿繡", "白臉人", "白二", "白熊",
    "貝錦儀", "貝海石", "貝人龍",
    "本相", "本觀", "本因", "本參",
    "包不同", "包不靚", "包萬葉", "包惜弱",
    "鮑千靈", "鮑大楚", "鮑承先",
    "寶樹", "寶象",
    "卜泰", "卜垣", "卜沉",
    "博爾術", "博爾忽", "撥速臺", "波羅星", "不戒", "班淑嫻", "筆貼式",
    "百草仙",

    // C
    "遲玄", "遲百城",
    "陳家洛", "陳世倌", "陳近南", "陳玄風", "陳達海", "陳正德", "陳珂",
    "陳孤雁", "陳圓圓", "陳高波", "陳歪嘴", "陳大方", "陳老丐", "陳禹",
    "陳沖之", "陳友諒", "陳七",
    "程英", "程靈素", "程嘲風", "程清霜", "程青霜", "程瑤迦", "程維藩",
    "程瑛", "程青竹",
    "成昆", "成不憂", "成自學", "成高", "成吉思汗", "成璜",
    "常伯志", "常赫志", "常敬之", "常金鵬", "常長風", "常遇春",
    "崔希敏", "崔志方", "崔百泉", "崔百勝", "崔綠華", "崔瞎子", "崔秋山",
    "蔡子峰", "蔡邑", "蔡威", "蔡德忠",
    "曹雲奇", "曹猛", "曹能", "曹司朋", "曹化淳",
    "察合臺", "察爾珠",
    "澄光", "澄通", "澄觀", "澄心", "澄識",
    "出塵子", "採花子", "長青子", "沖虛", "叢不棄", "侍劍", "岑其斯",
    "赤老溫", "車爾庫", "昌齊",

    // D
    "狄修", "狄雲",
    "杜百當", "杜希孟", "杜立德",
    "丁春秋", "丁敏君", "丁堅", "丁典", "丁當", "丁大全", "丁遊",
    "丁不三", "丁不四", "丁璫", "丁勉", "丁同", "丁敏尹",
    "鄧百川", "鄧炳春", "鄧八公", "鄧愈",
    "段延慶", "段正淳", "段正明", "段譽", "段天德", "段智興",
    "多隆", "多爾袞",
    "大痴", "大癲", "大苦", "大悲", "大頭鬼",
    "渡厄", "渡劫", "渡難", "定閒", "定逸", "定靜",
    "達摩", "達爾巴", "德布", "德鄂", "德成",
    "獨孤求敗", "黛綺絲", "丹青生", "刀白鳳", "戴永明", "洞玄", "董開山",
    "東方不敗", "端木元", "都史", "對喀納", "吊死鬼", "點蒼漁隱", "都大錦",

    // E
    "鄂爾多",

    // F
    "範百齡", "範遙", "範松", "範驊", "範禹", "範中恩", "範一飛",
    "范文程",
    "方大洪", "方怡", "方生", "方證", "方人智", "方有德", "方東白",
    "方天勞", "方臘", "方評",
    "風清揚", "風萬裡", "風波惡", "風良", "風際中", "風陵師太",
    "鳳南天", "鳳一鳴", "鳳七",
    "馮阿三", "馮錫範", "馮默風", "馮衡", "馮振武", "馮同知", "馮輝",
    "馮難敵", "馮不摧", "馮不破", "馮坦",
    "費彬", "費要多羅",
    "樊綱", "樊一翁",
    "封不平", "封弓影", "封萬裡",
    "傅思歸", "符敏儀", "浮塵子", "福康安", "富春",

    // G
    "郭嘯天", "郭靖", "郭襄", "郭芙", "郭破虜", "郭玉堂",
    "高根明", "高山王", "高則成", "高升泰", "高裡津", "高彥超", "高克新",
    "高三娘子",
    "歸辛樹", "歸二孃", "歸鍾",
    "公孫止", "公孫綠萼", "公冶乾",
    "古篤誠", "古松子", "古般若",
    "關安基", "關夫子", "關明梅",
    "耿萬鍾", "耿天霜",
    "葛光佩", "葛爾丹", "葛通",
    "顧炎武", "顧金標",
    "過三拳", "過彥之",
    "蓋一鳴", "蓋運聰",
    "龔光傑", "孤鴻子", "苟讀", "甘寶寶", "幹光豪", "狗肉頭陀", "剛相", "宮九佳",

    // H
    "黑白子", "黑熊",
    "哈大霸", "哈合臺",
    "何足道", "何太沖", "何鐵手", "何惕守", "何紅藥", "何沅君", "何思豪",
    "何望海", "何三七",
    "和里布", "和珅", "和爾大",
    "韓寶駒", "韓小瑩", "韓文衝", "韓春霖", "韓無垢", "韓老丐", "韓千葉",
    "韓林兒",
    "胡斐", "胡一刀", "胡青牛", "胡逸之", "胡德第", "胡大哥", "胡青羊",
    "胡桂南", "胡老三",
    "呼音克", "呼巴音",
    "忽必烈", "忽倫大虎", "忽倫二虎", "忽倫三虎", "忽倫四虎", "忽都虎",
    "黃裳", "黃藥師", "黃蓉", "黃伯流", "黃鐘公", "黃希節", "黃國柏",
    "黃甫", "黃金魁", "黃眉", "黃宗羲", "黃真", "黃二毛子", "黃鬚人",
    "霍都", "霍青桐", "霍元龍", "霍阿伊",
    "洪七公", "洪凌波", "洪安通", "洪人雄", "洪哮天", "洪朝", "洪勝海",
    "侯人英", "侯君集", "侯通海", "侯飛文",
    "花萬紫", "花劍影", "花鐵幹", "花雲",
    "海大富", "海蘭弼",
    "郝大通", "郝密",
    "華赫艮", "華輝", "華箏", "華伯斯基",
    "慧方", "慧觀", "慧淨", "慧真", "紅葉", "紅娘子", "輝月使", "皇太極",
    "赫大通", "赫連鐵樹", "鶴筆翁", "罕貼摩", "皇甫閣", "呼延萬善", "賀老三",

    // J
    "姬清玄", "姬曉峰",
    "金輪法王", "金花婆婆",
    "蔣四根", "蔣濤", "蔣調侯", "蔣天壽", "蔣士銓",
    "紀曉芙", "計老人", "計無施",
    "姜小鐵", "姜鐵山", "姜師叔", "姜文",
    "賈老六", "賈布", "賈人達",
    "鞠文泰", "鞠智盛",
    "菊友", "菊劍", "菊芳",
    "焦文期", "焦木", "焦公禮", "焦宛兒",
    "簡捷", "江百勝", "傑書", "建寧公主", "吉人通",
    "靜虛", "靜玄", "靜空", "靜照", "靜迦", "靜慧",
    "覺遠", "覺月", "淨清", "淨濟", "靜智", "建除", "鳩摩智", "九難", "九死生",

    // K
    "康熙", "康廣陵",
    "柯鎮惡", "柯萬鈞",
    "空見", "空聞", "空智", "空性", "空相",
    "鄺天雄", "鄺寶官",
    "凱別興", "喀絲麗", "枯容", "枯木",

    // L
    "李文秀", "李四", "李莫愁", "李秋水", "李延慶", "李沅芷", "李傀儡",
    "李萬山", "李三", "李志常", "李天垣", "李自成", "李可秀", "李春來",
    "李廷豹", "李萍", "李西華", "李式開", "李力世", "李大元", "李四摧",
    "李天恆", "李巖",
    "林遠圖", "林鎮南", "林平之", "林玉龍", "林朝英", "林興珠", "林永超", "林剛",
    "樑子翁", "梁發", "梁自進",
    "劉處玄", "劉正風", "劉培生", "劉竹莊", "劉鶴真", "劉之餘", "劉元鶴",
    "劉乘風", "劉瑛姑", "劉一舟", "劉芳亮", "劉宗敏", "劉於義", "劉菁",
    "劉敖", "劉芹",
    "呂文德", "呂留良", "呂四娘", "呂小妹", "呂葆中", "呂毅中", "呂正平",
    "呂七",
    "陸大有", "陸菲青", "陸萬通", "陸乘風", "陸展元", "陸立鼎", "陸柏",
    "陸無雙", "陸二孃", "陸冠英", "陸天抒", "陸高軒",
    "淩退思", "凌霜華",
    "藍鳳凰", "藍天和", "藍秦", "蘭劍", "藍天野",
    "魯有腳", "魯坤", "魯連榮",
    "鹿清篤", "鹿杖客",
    "柳大洪", "柳燕",
    "老不死", "老頭子",
    "羅信", "羅人傑", "羅大千", "羅立如",
    "雷猛", "雷一嘯",
    "令狐沖", "黎剛", "黎生", "龍駿", "龍德鄰", "靈智上人", "龍島主",
    "綠竹翁", "駱冰", "冷謙", "勞德諾", "盧一峰", "廖自礪",
    "流雲使", "來福兒", "靈虛",

    // M
    "馬大鳴", "馬鈺", "馬俱為", "馬法通", "馬家駿", "馬善均", "馬佑",
    "馬敬俠", "馬真", "馬大元", "馬行空", "馬春花", "馬五德", "馬寶",
    "馬博仁", "馬喇", "馬超興", "馬光佐", "馬大挺", "馬青雄", "馬齊",
    "莫聲谷", "莫大", "莫大先生",
    "苗人鳳", "苗若蘭",
    "梅劍和", "梅超風", "梅良鳴", "梅念笙", "梅劍", "梅文馨", "梅芳姑",
    "慕容博", "慕容復", "慕容景嶽", "慕天顏",
    "木婉清", "木卓倫", "木文察", "木華黎", "木高峰", "木島主", "木桑",
    "沐劍屏", "沐劍聲",
    "穆貴妃", "穆念慈", "穆人清",
    "孟健雄", "孟師叔", "孟正鴻", "孟伯飛", "孟鑄", "孟錚",
    "米為義", "米思翰", "米橫野",
    "閔子華", "閔柔",
    "滅絕", "毛東珠", "茅十八", "明珠", "明月", "瑪米爾", "蒙哥",
    "麥鯨", "妙風使", "夢姑", "摩訶巴思", "滅絕師太",
});

string *novel_name1 = ({
    // N
    "南希仁", "南懷仁", "南仁通", "南蘭", "南海鱷神",
    "倪不大", "倪不小", "倪浩",
    "甯中則", "寧完我", "努兒海", "聶鉞", "尼摩星",

    // O
    "歐陽峰", "歐陽克", "歐陽公政", "歐陽牧之", "歐治子",

    // P
    "平一指", "平旺先", "平阿四", "平婆婆", "平威", "平四",
    "彭有淨", "彭瑩玉", "彭連虎", "彭三春",
    "胖頭陀", "皮清雲", "潘天耕", "潘秀達",

    // Q
    "戚長髮", "戚芳",
    "齊自勉", "齊伯濤", "齊元凱", "齊洛諾夫", "齊雲", "齊雲敖",
    "祁清彪", "祁六三", "祁志誠", "祁天彪",
    "喬三槐", "喬峰", "喬福",
    "裘千仞", "裘千丈", "裘千尺",
    "曲靈風", "曲非煙", "曲洋", "曲三",
    "秦紅棉", "秦耐之", "秦錦", "秦娟", "秦偉邦", "秦老五", "秦棟",
    "錢老本", "錢青健", "錢正倫", "錢二敗", "錢通四",
    "全冠清", "全金髮",
    "乾隆", "丘處機", "邱山風", "樵子", "仇松年", "晴畫", "泉建男",
    "青靈子", "清風", "清虛",

    // R
    "任我行", "任盈盈", "任飛燕", "任通武",
    "阮星竹", "阮士忠",
    "瑞婆婆", "瑞大林", "瑞芳", "瑞棟",
    "容子矩", "榮彩", "蕊初", "人廚子", "若克琳",

    // S
    "施令威", "施戴子", "施琅",
    "司徒雷", "司徒鶴", "司徒橫", "司徒伯雷", "司徒千鍾",
    "司空玄", "司馬林", "司馬大",
    "石清", "石破天", "石中玉", "石雙英", "石嫂", "石清露", "石萬嗔", "石駿",
    "史伯威", "史仲猛", "史孟捷", "史叔剛", "史季強", "史小翠", "史億刀",
    "史仲俊", "史青山", "史登達", "史火龍", "史孟龍", "史紅石", "史松",
    "史秉文", "史秉光",
    "沙通天", "沙天江", "沙老大", "沙廣天",
    "蘇荃", "蘇星河", "蘇萬虹", "蘇魯克", "蘇普", "蘇習之", "蘇菲亞",
    "蘇岡", "蘇夢清", "蘇毅",
    "舒化龍", "舒奇",
    "宋遠橋", "宋青書", "宋善朋", "宋天保", "宋德方", "宋五", "宋獻策",
    "孫不二", "孫仲君", "孫克通", "孫剛峰", "孫伏虎", "孫均", "孫思克",
    "孫大善", "孫老三", "孫萬年", "孫三毀", "孫仲壽", "孫仲尹",
    "邵燕", "邵鶴",
    "商老太", "商寶震",
    "單伯山", "單仲山", "單叔山", "單季山", "單小山", "單正", "單鐵生",
    "桑三娘", "桑斯兒", "桑飛虹", "桑土公", "桑昆", "桑結", "桑拉巴",
    "上官雲", "上官虹", "上官劍南", "上官毅山", "上官", "上官鐵生",
    "水笙", "水福", "水岱", "水鑑", "水雲",
    "申志凡", "申人俊",
    "沈城", "沈德潛", "沈青剛",
    "雙兒", "說不得", "泗水漁隱", "朮赤", "室裡", "索額圖", "瘦頭陀", "薩多",
    "傻姑", "壽南山", "獅吼子", "時萬年", "神山", "神音", "蛇皮張", "喪門鬼",
    "侍劍", "侍刀", "侍杖", "侍槍", "侍斧", "侍叉", "侍鞭",

    // T
    "譚公", "譚婆", "譚處端", "譚青", "譚迪人", "覃天丞", "譚文理",
    "田歸農", "田伯光", "田青文", "田見秀",
    "天狼子", "天門", "天松", "天柏", "天乙", "天鏡", "天虹", "天山童姥",
    "天竺僧", "天虛", "天鳴",
    "唐文亮", "唐光雄", "唐洋", "唐六爺",
    "童百熊", "童懷道", "童兆和", "童大海", "佟國綱",
    "陶子安", "陶百歲", "陶紅英", "陶鈞",
    "桃幹仙", "桃根仙", "桃花仙", "桃實仙", "桃葉仙", "桃枝仙", "桃紅",
    "湯沛", "湯祖德", "湯若望", "湯和",
    "拖雷", "鐵木真", "禿筆翁", "圖海道", "圖爾布青", "騰一雷", "討債鬼", "太虛子",

    // W
    "王重陽", "王處一", "王夫人", "王難姑", "王語嫣", "王十三", "王潭",
    "王劍英", "王劍傑", "王仲萍", "王武通", "王進寶", "王志坦", "王罕",
    "王伯奮", "王家駒", "王家駿", "王元霸", "王仲強", "王維揚", "王誠",
    "王惟忠", "王老六", "王萬仞", "王八衰", "王保保", "王琪", "王道",
    "汪萬翼", "汪浩天", "汪劍通", "汪鐵鶚", "汪嘯風",
    "溫南揚", "溫方達", "溫方山", "溫方悟", "溫方施", "溫方義", "溫儀",
    "溫青青", "溫有方", "溫有道", "溫仁厚", "溫正", "溫青",
    "吳領軍", "吳光勝", "吳長風", "吳六奇", "吳三桂", "吳應熊", "吳坎",
    "吳之榮", "吳大鵬", "吳青烈", "吳立身", "吳寶宇", "吳柏英", "吳禎",
    "吳國棟", "吳道通", "吳天德", "吳勁草", "吳良", "吳平",
    "無崖子", "無青子", "無塵", "無色", "無相", "無常鬼",
    "武眠風", "武三通", "武敦儒", "武修文", "武銘夫", "武三娘", "武青纓",
    "武天風", "武烈",
    "文醉翁", "文泰來",
    "聞萬夫", "聞蒼松",
    "韋小寶", "韋一笑", "韋春花",
    "衛春華", "衛璧", "衛周祚", "衛天望", "衛四娘",
    "萬震山", "萬圭", "萬大平", "萬慶瀾", "萬裡風",
    "完顏萍", "完顏洪烈", "完顏洪熙", "完顏阿骨打",
    "窩闊臺", "瓦耳拉齊", "烏老大",    "烏旺阿普", "五符", "五姑",

    // X
    "西門觀止", "西華子",
    "蕭峰", "蕭中慧", "蕭半和", "蕭遠山",
    "薛鵲", "薛慕華", "薛公遠", "薛燭",
    "小龍女", "小鳳", "小昭", "小翠", "小桂子", "小玄子", "小菊",
    "小棒頭", "小翠", "小虹", "小玲",
    "謝煙客", "謝遜", "謝不當",
    "解風", "解文豹",
    "夏雪宜", "夏青青", "夏國相", "夏胄",
    "徐天宏", "徐潮生", "徐錚", "徐達", "徐小舍", "徐天川",
    "許雪亭", "許卓誠",
    "辛雙清", "辛然", "辛國樑", "心硯", "心溪",
    "向問天", "向大年", "項易天",
    "玄慈", "玄痛", "玄悲", "玄寂", "玄苦", "玄難", "玄生", "玄澄", "玄慚",
    "瀟湘子", "逍遙子", "血滴子", "血刀老祖", "鮮於通", "虛竹", "西寶",
    "玄燁", "熊元獻", "行痴", "行顛",

    // Y
    "楊過", "楊康", "楊鐵心", "楊成協", "楊蓮亭", "楊不悔", "楊光",
    "楊逍", "楊賓", "楊溢之", "楊景亭", "楊鵬舉", "楊中慧",
    "遊駒", "遊驥", "遊坦之", "遊迅", "遊訊",
    "殷梨亭", "殷天正", "殷野王", "殷素素", "殷螭", "殷仲翔", "殷吉", "殷錦",
    "殷無祿", "殷無福", "殷無壽",
    "袁崇煥", "袁承志", "袁冠南", "袁紫衣", "袁士霄", "袁枚",
    "元傷", "元痛", "元悲", "元義方", "元澄", "元廣波",
    "嶽不群", "嶽靈珊", "嶽老三", "嶽肅",
    "餘滄海", "餘人彥", "餘魚同", "餘洪興", "餘嫂", "餘婆婆", "餘兆興",
    "於人豪", "於萬亭", "於光豪", "於八", "於嫂",
    "俞蓮舟", "俞岱巖", "俞朝奉",
    "玉音子", "玉磯子", "玉璣子", "玉磐子", "玉磬子", "玉鍾子", "玉林",
    "玉如意", "玉真子", "玉靈", "鬱光標",
    "易大彪", "易三娘", "易吉", "易國梓",
    "尹志平", "尹克西", "尹章垓",
    "姚伯當", "姚春", "姚必達", "姚清泉",
    "雲中鶴", "雲島主", "雲素梅", "雲鶴",
    "葉長青", "葉二孃",
    "耶律燕", "耶律洪基", "耶律莫哥", "耶律涅魯古", "耶律重元", "耶律楚材",
    "耶律晉", "耶律齊",
    "英白羅", "英顎", "瑛姑",
    "緣根", "圓真", "圓音", "圓業", "圓心",
    "儀琳", "儀清", "儀和", "儀質", "儀靈", "儀光", "儀淨", "儀真", "儀文",
    "言伯乾", "言達平",
    "閻世章", "閻世魁", "閻基",
    "顏垣", "延萬善", "嚴三星", "義生", "應松", "一燈大師",
    "雍正", "一燈", "樂厚", "幽草", "陽頂天", "尤得勝", "尉遲連", "銀葉先生",

    // Z
    "張三豐", "張君寶", "張翠山", "張松溪", "張三", "張無忌", "張阿生",
    "張乘風", "張乘雲", "張萬風", "張全祥", "張中", "張浩天", "張飛雄",
    "張十五", "張淡月", "張康年", "張金鏊", "張九", "張安官", "張志光",
    "張召重", "張一氓", "張二叔", "張朝唐", "張信", "張春九", "張若谷",
    "張勇", "張康",
    "章老三", "章進",
    "周伯通", "周芷若", "周威信", "周顛", "周綺", "周仲英", "周隆",
    "周鐵鶴", "周雲陽", "周孤桐", "周桐", "周圻", "周子旺", "周阿三",
    "周英傑", "週五輸", "周牧",
    "卓不凡", "卓天雄",
    "左冷禪", "左全", "左子穆",
    "諸萬春", "諸萬裡", "諸保昆", "褚圓", "褚轟", "褚萬裡", "褚萬春",
    "褚紅柏",
    "朱丹臣", "朱子柳", "朱祖蔭", "朱九真", "朱長齡", "朱聰", "朱元璋",
    "朱安國",
    "祖大壽", "祖千秋",
    "曾鐵鷗", "曾阿牛", "曾柔", "曾圖南",
    "鄭三娘", "鄭成功", "鄭克爽", "鄭萼", "鄭板橋", "鄭光芝", "鄭七滅",
    "鄭起雲",
    "趙半山", "趙敏", "趙志敬", "趙錢孫", "趙洵", "趙斐", "趙鶴",
    "趙齊賢", "趙良棟", "趙一傷", "趙城之",
    "莊有恭", "莊錚", "莊廷壠", "莊允城",
    "宗維俠", "宗雄", "宗贊王子",
    "鍾兆文", "鍾兆英", "鍾兆能", "鍾四嫂", "鍾小二", "鍾萬仇", "鍾靈",
    "鍾阿四", "鍾志靈", "鍾鎮",
    "智光", "摘星子", "詹春", "止清", "查繼佐", "震山子", "子聰", "照虛",
    "哲別", "哲羅星", "者勒米", "札木合", "蛛兒", "兆惠", "竹劍", "展飛",
});

int valid_name(string name)
{
    int len = strlen(name);
    int i, j;

    if(member_array(name, novel_name) != -1)
        return 0;

    if(member_array(name, novel_name1) != -1)
        return 0;

    for(i = 0; i < len; i += 2)
        for(j = i + 1; j < len; j += 2)
            if(member_array(name[i..j], banned_name) != -1)
                return 0;
    return 1;
}
