// This program is a part of NITAN MudLIB 
// redl 2013/9
inherit NPC;
#include <ansi.h>

#define START_INTERVAL 15       //分鐘
#define TEACH_NUM 18
#define TEACH_COIN -5000000

int clean_up() { return 1;}

mapping *listen = ({
        ([      "msg"           :       "$N在課桌下玩手機，被$n一瞪，嚇得趕緊坐正。\n",
                "value"         :       10
        ]),
        ([      "msg"           :       "$N挪了挪座凳，忍不住放了個響屁。\n",
                "value"         :       10
        ]),
        ([      "msg"           :       "$N偷偷掏了塊牛肉乾放在嘴裡，小心慢慢地嚼動著。\n",
                "value"         :       10
        ]),
        ([      "msg"           :       "$N抽出一本武俠小說，蓋在課本上偷看。\n",
                "value"         :       13
        ]),
        ([      "msg"           :       "$N斜著頭望向窗外的樹枝上，好像有兩隻鳥在打架。\n",
                "value"         :       13
        ]),
        ([      "msg"           :       "$N趁$n沒看見，一把搶過同桌的作業猛抄。\n",
                "value"         :       15
        ]),
        ([      "msg"           :       "$N做賊心虛地看了看講臺，偷偷把玩前桌女同學的辮子。\n",
                "value"         :       18
        ]),
        ([      "msg"           :       "$N趁$n不注意，用剪子剪去了前桌男同學的一縷頭髮。\n",
                "value"         :       18
        ]),
        ([      "msg"           :       "$N呆呆地盯著$n的衣襟，看得口水直流，不知道在想些什麼？\n",
                "value"         :       36
        ])
});

mapping *book_exp = ({
        ([  "name"              :       "三字經",
                "lv"            :       320,
                "content"       :       ({
                        "    人之初，性本善，性相近，習相遠，苟不教，性乃遷",
                        "    教之道，貴以專，昔孟母，擇鄰處，子不學，斷機杼",
                        "    竇燕山，有義方，教五子，名俱揚，養不教，父之過",
                        "    教不嚴，師之惰，子不學，非所宜，幼不學，老何為",
                        "    玉不琢，不成器，人不學，不知義，為人子，方少時",
                        "    親師友，習禮儀，香九齡，能溫席，孝於親，所當執",
                        "    融四歲，能讓梨，弟於長，宜先知，首孝弟，次見聞",
                        "    知某數，識某文，一而十，十而百，百而千，千而萬",
                        "    三才者，天地人，三光者，日月星，三綱者，君臣義",
                        "    父子親，夫婦順，曰春夏，曰秋冬，此四時，運不窮",
                        "    曰南北，曰西東，此四方，應乎中，曰水火，木金土",
                        "    此五行，本乎數，曰仁義，禮智信，此五常，不容紊",
                        "    稻粱菽，麥黍稷，此六穀，人所食，馬牛羊，雞犬豕",
                        "    此六畜，人所飼，曰喜怒，曰哀懼，愛惡欲，七情具",
                        "    匏土革，木石金，絲與竹，乃八音，高曾祖，父而身",
                        "    身而子，子而孫，自子孫，至玄曾，乃九族，人之倫",
                        "    父子恩，夫婦從，兄則友，弟則恭，長幼序，友與朋",
                        "    君則敬，臣則忠，此十義，人所同，凡訓蒙，須講究",
                        "    詳訓詁，名句讀，為學者，必有初，小學終，至四書",
                        "    論語者，二十篇，群弟子，記善言，孟子者，七篇止",
                        "    講道德，說仁義，作中庸，乃孔伋，中不偏，庸不易",
                        "    作大學，乃曾子，自修齊，至平治，孝經通，四書熟",
                        "    如六經，始可讀，詩書易，禮春秋，號六經，當講求",
                        "    有連山，有歸藏，有周易，三易詳，有典謨，有訓誥",
                        "    有誓命，書之奧，我周公，作周禮，著六官，存治體",
                        "    大小戴，注禮記，述聖言，禮樂備，曰國風，曰雅頌",
                        "    號四詩，當諷詠，詩既亡，春秋作，寓褒貶，別善惡",
                        "    三傳者，有公羊，有左氏，有穀梁，經既明，方讀子",
                        "    撮其要，記其事，五子者，有荀楊，文中子，及老莊",
                        "    經子通，讀諸史，考世系，知終始，自羲農，至黃帝",
                        "    號三皇，居上世，唐有虞，號二帝，相揖遜，稱盛世",
                        "    夏有禹，商有湯，周文武，稱三王，夏傳子，家天下",
                        "    四百載，遷夏社，湯伐夏，國號商，六百載，至紂亡",
                        "    周武王，始誅紂，八百載，最長久，周轍東，王綱墮",
                        "    逞干戈，尚遊說，始春秋，終戰國，五霸強，七雄出",
                        "    嬴秦氏，始兼併，傳二世，楚漢爭，高祖興，漢業建",
                        "    至孝平，王莽篡，光武興，為東漢，四百年，終於獻",
                        "    魏蜀吳，爭漢鼎，號三國，迄兩晉，宋齊繼，梁陳承",
                        "    為南朝，都金陵，北元魏，分東西，宇文周，與高齊",
                        "    迨至隋，一土宇，不再傳，失統緒，唐高祖，起義師",
                        "    除隋亂，創國基，二十傳，三百載，梁滅之，國乃改",
                        "    梁唐晉，及漢周，稱五代，皆有由，炎宋興，受周禪",
                        "    十八傳，南北混，遼與金，皆稱帝，元滅金，絕宋世",
                        "    輿圖廣，超前代，九十年，國祚廢，太祖興，國大明",
                        "    號洪武，都金陵，迨成祖，遷燕京，十六世，至崇禎",
                        "    權閹肆，寇如林，李闖出，神器焚，清世祖，應景命",
                        "    靖四方，克大定，古今史，全在茲，載治亂，知興衰",
                        "    讀史書，考實錄，通古今，若親目，口而誦，心而惟",
                        "    朝於斯，夕於斯，昔仲尼，師項橐，古聖賢，尚勤學",
                        "    趙中令，讀魯論，彼既仕，學且勤，披蒲編，削竹簡",
                        "    彼無書，且知勉，頭懸樑，錐刺股，彼不教，自勤苦",
                        "    如囊螢，如映雪，家雖貧，學不輟，如負薪，如掛角",
                        "    身雖勞，猶苦卓，蘇老泉，二十七，始發憤，讀書籍",
                        "    彼既老，猶悔遲，爾小生，宜早思，若梁灝，八十二",
                        "    對大廷，魁多士，彼既成，眾稱異，爾小生，宜立志",
                        "    瑩八歲，能詠詩，泌七歲，能賦棋，彼穎悟，人稱奇",
                        "    爾幼學，當效之，蔡文姬，能辨琴，謝道韞，能詠吟",
                        "    彼女子，且聰敏，爾男子，當自警，唐劉晏，方七歲",
                        "    舉神童，作正字，彼雖幼，身已仕，爾幼學，勉而致",
                        "    有為者，亦若是，犬守夜，雞司晨，苟不學，曷為人",
                        "    蠶吐絲，蜂釀蜜，人不學，不如物，幼而學，壯而行",
                        "    上致君，下澤民，揚名聲，顯父母，光於前，裕於後",
                        "    人遺子，金滿嬴，我教子，惟一經，勤有功，戲無益"
                        })
        ]),
        ([  "name"              :       "千字文",
                "lv"            :       360,
                "content"       :       ({
                        "    天地玄黃，宇宙洪荒，日月盈昃，辰宿列張",
                        "    寒來暑往，秋收冬藏，閏餘成歲，律呂調陽",
                        "    雲騰致雨，露結為霜，金生麗水，玉出昆岡",
                        "    劍號巨闕，珠稱夜光，果珍李柰，菜重芥姜",
                        "    海鹹河淡，鱗潛羽翔，龍師火帝，鳥官人皇",
                        "    始制文字，乃服衣裳，推位讓國，有虞陶唐",
                        "    弔民伐罪，周發殷湯，坐朝問道，垂拱平章",
                        "    愛育黎首，臣伏戎羌，遐邇壹體，率賓歸王",
                        "    鳴鳳在樹，白駒食場，化被草木，賴及萬方",
                        "    蓋此身發，四大五常，恭惟鞠養，豈敢毀傷",
                        "    女慕貞絜，男效才良，知過必改，得能莫忘",
                        "    罔談彼短，靡恃己長，信使可覆，器欲難量",
                        "    墨悲絲染，詩讃羔羊，景行維賢，克唸作聖",
                        "    德建名立，形端表正，空谷傳聲，虛堂習聽",
                        "    禍因惡積，福緣善慶，尺璧非寶，寸陰是競",
                        "    資父事君，曰嚴與敬，孝當竭力，忠則盡命",
                        "    臨深履薄，夙興溫凊，似蘭斯馨，如松之盛",
                        "    川流不息，淵澄取映，容止若思，言辭安定",
                        "    篤初誠美，慎終宜令，榮業所基，籍甚無竟",
                        "    學優登仕，攝職從政，存以甘棠，去而益詠",
                        "    樂殊貴賤，禮別尊卑，上和下睦，夫唱婦隨",
                        "    外受傅訓，入奉母儀，諸姑伯叔，猶子比兒",
                        "    孔懷兄弟，同氣連枝，交友投分，切磨箴規",
                        "    仁慈隱惻，造次弗離，節義廉退，顛沛匪虧",
                        "    性靜情逸，心動神疲，守真志滿，逐物意移",
                        "    堅持雅操，好爵自縻，都邑華夏，東西二京",
                        "    背邙面洛，浮渭據涇，宮殿盤鬱，樓觀飛驚",
                        "    圖寫禽獸，畫彩仙靈，丙舍傍啟，甲帳對楹",
                        "    肆筵設席，鼓瑟吹笙，升階納陛，弁轉疑星",
                        "    右通廣內，左達承明，既集墳典，亦聚群英",
                        "    杜稾鍾隸，漆書壁經，府羅將相，路俠槐卿",
                        "    戶封八縣，家給千兵，高冠陪輦，驅轂振纓",
                        "    世祿侈富，車駕肥輕，策功茂實，勒碑刻銘",
                        "    磻溪伊尹，佐時阿衡，奄宅曲阜，微旦孰營",
                        "    桓公匡合，濟弱扶傾，綺回漢惠，說感武丁",
                        "    俊乂密勿，多士寔寧，晉楚更霸，趙魏困橫",
                        "    假途滅虢，踐土會盟，何遵約法，韓弊煩刑",
                        "    起翦頗牧，用軍最精，宣威沙漠，馳譽丹青",
                        "    九州禹跡，百郡秦並，嶽宗恆岱，禪主雲亭",
                        "    雁門紫塞，雞田赤城，昆池碣石，鉅野洞庭",
                        "    曠遠緜邈，巖岫杳冥，治本於農，務茲稼穡",
                        "    俶載南畝，我藝黍稷，稅熟貢新，勸賞黜陟",
                        "    孟軻敦素，史魚秉直，庶幾中庸，勞謙謹敕",
                        "    聆音察理，鑑貌辨色，貽厥嘉猷，勉其祗植",
                        "    省躬譏誡，寵增抗極，殆辱近恥，林皋幸即",
                        "    兩疏見機，解組誰逼，索居閒處，沈默寂寥",
                        "    求古尋論，散慮逍遙，欣奏累遣，戚謝歡招",
                        "    渠荷的歷，園莽抽條，枇杷晚翠，梧桐早凋",
                        "    陳根委翳，落葉飄颻，遊鵾獨運，凌摩絳霄",
                        "    耽讀翫市，寓目囊箱，易輶攸畏，屬耳垣牆",
                        "    具膳飡飯，適口充腸，飽飫烹宰，飢厭糟糠",
                        "    親戚故舊，老少異糧，妾御績紡，侍巾帷房",
                        "    紈扇圓潔，銀燭煒煌，晝眠夕寐，藍筍象床",
                        "    絃歌酒讌，接杯舉觴，矯手頓足，悅豫且康",
                        "    嫡後嗣續，祭祀烝嘗，稽顙再拜，悚懼恐惶",
                        "    牋牒簡要，顧答審詳，骸垢想浴，執熱願涼",
                        "    驢騾犢特，駭躍超驤，誅斬賊盜，捕獲叛亡",
                        "    布射遼丸，嵇琴阮嘯，恬筆倫紙，鈞巧任釣",
                        "    釋紛利俗，並皆佳妙，毛施淑姿，工顰妍笑",
                        "    年矢每催，曦暉朗耀，璇璣懸斡，晦魄環照",
                        "    指薪修祜，永綏吉劭，矩步引領，俯仰廊廟",
                        "    束帶矜莊，徘徊瞻眺，孤陋寡聞，愚蒙等誚"
                        })
        ]),
        ([  "name"              :       "道德經",
                "lv"            :       420,
                "content"       :       ({
                        "    道可道，非常道。名可名，非常名。\n"
                        "    無名天地之始﹔有名萬物之母。\n"
                        "    故常無，欲以觀其妙﹔常有，欲以觀其徼。\n"
                        "    此兩者，同出而異名，同謂之玄。\n"
                        "    玄之又玄，眾妙之門。",
                        "    天下皆知美之為美，斯惡已。\n"
                        "    皆知善之為善，斯不善已。\n"
                        "    有無相生，難易相成，長短相形，\n"
                        "    高下相盈，音聲相和，前後相隨。\n"
                        "    恆也。是以聖人處無為之事，\n"
                        "    行不言之教﹔萬物作而弗始，\n"
                        "    生而弗有，為而弗恃，功成而不居。\n"
                        "    夫唯弗居，是以不去。",
                        "    不尚賢，使民不爭\n"
                        "    不貴難得之貨，使民不為盜﹔\n"
                        "    不見可欲，使民心不亂。\n"
                        "    是以聖人之治，\n"
                        "    虛其心，\n"
                        "    實其腹，\n"
                        "    弱其志，\n"
                        "    強其骨。\n"
                        "    常使民無知無慾。\n"
                        "    使夫智者不敢為也。\n"
                        "    為無為，則無不治。",
                        "    道衝，而用之或不盈。\n"
                        "    淵兮，似萬物之宗﹔湛兮，似或存。\n"
                        "    吾不知誰之子，象帝之先。",
                        "    天地不仁，以萬物為芻狗﹔聖人不仁，以百姓為芻狗。\n"
                        "    天地之間，其猶橐鑰乎。虛而不屈，動而愈出。\n"
                        "    多言數窮，不如守中。",
                        "    穀神不死，是謂玄牝。\n"
                        "    玄牝之門，是謂天地根。帛系若存，用之不勤。",
                        "    天長地久。\n"
                        "    天地所以能長且久者，\n"
                        "    以其不自生，故能長生。\n"
                        "    是以聖人後其身而身先﹔外其身而身存。\n"
                        "    非以其無私邪。\n"
                        "    故能成其私。",
                        "    上善若水。\n"
                        "    水善利萬物而不爭，\n"
                        "    處眾人之所惡，故幾於道。\n"
                        "    居善地，心善淵，與善仁，\n"
                        "    言善信，政善治，事善能，\n"
                        "    動善時。夫唯不爭，故無尤。",
                        "    持而盈之，不如其已﹔\n"
                        "    揣而銳之，不可長保。\n"
                        "    金玉滿堂，莫之能守﹔\n"
                        "    富貴而驕，自遺其咎。\n"
                        "    功遂身退，天之道也。",
                        "    載營魄抱一，能無離乎。\n"
                        "    專氣致柔，能如嬰兒乎。\n"
                        "    滌除玄鑑，能如疵乎。\n"
                        "    愛國治民，能無為乎。\n"
                        "    天門開闔，能為雌乎。\n"
                        "    明白四達，能無知乎。",
                        "    三十輻，共一轂，當其無，有車之用。\n"
                        "    埏埴以為器，當其無，有器之用。\n"
                        "    鑿戶牖以為室，當其無，有室之用。\n"
                        "    故有之以為利，無之以為用。",
                        "    五色令人目盲﹔五音令人耳聾﹔五味令人口爽﹔\n"
                        "    馳騁畋獵，令人心發狂﹔難得之貨，令人行妨。\n"
                        "    是以聖人為腹不為目，故去彼取此。",
                        "    寵辱若驚，貴大患若身。\n"
                        "    何謂寵辱若驚。\n"
                        "    寵為下，得之若驚，失之若驚，是謂寵辱若驚。\n"
                        "    何謂貴大患若身。\n"
                        "    吾所以有大患者，為吾有身，\n"
                        "    及吾無身，吾有何患。\n"
                        "    故貴以身為天下，若可寄天下﹔\n"
                        "    愛以身為天下，若可託天下。",
                        "    視之不見，名曰夷﹔\n"
                        "    聽之不聞，名曰希﹔\n"
                        "    搏之不得，名曰微。\n"
                        "    此三者不可致詰，故混而為一。\n"
                        "    其上不皦，其下不昧。\n"
                        "    繩繩兮不可名，復歸於物。\n"
                        "    是謂無狀之狀，無物之象，是謂惚恍。\n"
                        "    迎之不見其首，隨之不見其後。\n"
                        "    執古之道，以御今之有。\n"
                        "    能知古始，是謂道紀。",
                        "    古之善為道者，微妙玄通，深不可識。\n"
                        "    夫唯不可識，故強為之容：\n"
                        "    豫兮若冬涉川﹔\n"
                        "    猶兮若畏四鄰﹔\n"
                        "    儼兮其若客﹔\n"
                        "    渙兮其若凌釋﹔\n"
                        "    敦兮其若樸﹔\n"
                        "    曠兮其若谷﹔\n"
                        "    混兮其若濁﹔\n"
                        "    澹兮其若海﹔\n"
                        "    飂兮若無止。\n"
                        "    孰能濁以靜之徐清。\n"
                        "    孰能安以動之徐生。\n"
                        "    保此道者，不欲盈。\n"
                        "    夫唯不盈，故能蔽而新成。",
                        "    致虛極，守靜篤。\n"
                        "    萬物並作，吾以觀復。\n"
                        "    夫物芸芸，各復歸其根。\n"
                        "    歸根曰靜，靜曰覆命。\n"
                        "    覆命曰常，知常曰明。\n"
                        "    不知常，妄作兇。\n"
                        "    知常容，容乃公，\n"
                        "    公乃全，全乃天，\n"
                        "    天乃道，道乃久，沒身不殆。",
                        "    太上，不知有之﹔\n"
                        "    其次，親而譽之﹔\n"
                        "    其次，畏之﹔\n"
                        "    其次，侮之。\n"
                        "    信不足焉，有不信焉。\n"
                        "    悠兮其貴言。\n"
                        "    功成事遂，百姓皆謂：「我自然」。",
                        "    大道廢，有仁義﹔智慧出，有大偽﹔\n"
                        "    六親不和，有孝慈﹔國家昏亂，有忠臣。",
                        "    絕聖棄智，民利百倍﹔\n"
                        "    絕仁棄義，民復孝慈﹔\n"
                        "    絕巧棄利，盜賊無有。\n"
                        "    此三者以為文，不足。\n"
                        "    故令有所屬：見素抱樸，少思寡慾，絕學無憂。",
                        "    唯之與阿，相去幾何。\n"
                        "    之與惡，相去若何。\n"
                        "    人之所畏，不可不畏。\n"
                        "    荒兮，其未央哉。\n"
                        "    眾人熙熙，如享太牢，如春登臺。\n"
                        "    我獨泊兮，其未兆﹔\n"
                        "    沌沌兮，如嬰兒之未孩﹔\n"
                        "    儽儽兮，若無所歸。\n"
                        "    眾人皆有餘，而我獨若遺。我愚人之心也哉。\n"
                        "    俗人昭昭，我獨昏昏。\n"
                        "    俗人察察，我獨悶悶。\n"
                        "    眾人皆有以，而我獨頑且鄙。\n"
                        "    我獨異於人，而貴食母。",
                        "    孔德之容，惟道是從。\n"
                        "    道之為物，惟恍惟惚。\n"
                        "    惚兮恍兮，其中有象﹔恍兮惚兮，其中有物。\n"
                        "    窈兮冥兮，其中有精﹔其精甚真，其中有信。\n"
                        "    自今及古，其名不去，以閱眾甫。\n"
                        "    吾何以知眾甫之狀哉。以此。",
                        "    曲則全，枉則直，窪則盈，\n"
                        "    敝則新，少則得，多則惑。\n"
                        "    是以聖人抱一為天下式。\n"
                        "    不自見，故明﹔\n"
                        "    不自是，故彰﹔\n"
                        "    不自伐，故有功﹔\n"
                        "    不自矜，故長。\n"
                        "    夫唯不爭，故天下莫能與之爭。\n"
                        "    古之所謂「曲則全」者，豈虛言哉。\n"
                        "    誠全而歸之。",
                        "    希言自然。\n"
                        "    故飄風不終朝，驟雨不終日。\n"
                        "    孰為此者。\n"
                        "    天地。天地尚不能久，而況於人乎。\n"
                        "    故從事於道者，同於道﹔\n"
                        "    德者，同於德﹔失者，同於失。\n"
                        "    同於道者，道亦樂得之﹔\n"
                        "    同於德者，德亦樂得之﹔\n"
                        "    同於失者，失亦樂得之。\n"
                        "    信不足焉，有不信焉。",
                        "    企者不立﹔跨者不行﹔\n"
                        "    自見者不明﹔自是者不彰﹔\n"
                        "    自伐者無功﹔自矜者不長。\n"
                        "    其在道也，曰：餘食贅形。\n"
                        "    物或惡之，故有道者不處。",
                        "    有物混成，先天地生。\n"
                        "    寂兮寥兮，獨立而不改，\n"
                        "    周行而不殆，可以為天地母。\n"
                        "    吾不知其名，強字之曰道，強為之名曰大。\n"
                        "    大曰逝，逝曰遠，遠曰反。\n"
                        "    故道大，天大，地大，人亦大。\n"
                        "    域中有四大，而人居其一焉。\n"
                        "    人法地，地法天，天法道，道法自然。",
                        "    重為輕根，靜為躁君。\n"
                        "    是以君子終日行不離輜重。\n"
                        "    雖有榮觀，燕處超然。\n"
                        "    奈何萬乘之主，而以身輕天下。\n"
                        "    輕則失根，躁則失君。",
                        "    善行無轍跡，善言無瑕謫﹔\n"
                        "    善數不用籌策﹔善閉無關楗而不可開，\n"
                        "    善結無繩約而不可解。\n"
                        "    是以聖人常善救人，故無棄人﹔\n"
                        "    常善救物，故無棄物。\n"
                        "    是謂襲明。\n"
                        "    故善人者，不善人之師﹔\n"
                        "    不善人者，善人之資。\n"
                        "    不貴其師，不愛其資，\n"
                        "    雖智大迷，是謂要妙。",
                        "    知其雄，守其雌，為天下溪。\n"
                        "    為天下溪，常德不離，復歸於嬰兒。\n"
                        "    知其白，守其辱，為天下谷。\n"
                        "    為天下谷，常德乃足，復歸於樸。\n"
                        "    知其白，守其黑，為天下式。\n"
                        "    為天下式，常德不忒，復歸於無極。\n"
                        "    樸散則為器，聖人用之，\n"
                        "    則為官長，故大智不割。",
                        "    將欲取天下而為之，吾見其不得已。\n"
                        "    天下神器，不可為也，不可執也。\n"
                        "    為者敗之，執者失之。\n"
                        "    是以聖人無為，故無敗﹔\n"
                        "    無執，故無失。\n"
                        "    夫物或行或隨﹔或噓或吹﹔\n"
                        "    或強或羸﹔或載或隳。\n"
                        "    是以聖人去甚，去奢，去泰。",
                        "    以道佐人主者，不以兵強天下。\n"
                        "    其事好遠。\n"
                        "    師之所處，荊棘生焉。\n"
                        "    大軍之後，必有凶年。\n"
                        "    善有果而已，不以取強。\n"
                        "    果而勿矜，果而勿伐，果而勿驕。\n"
                        "    果而不得已，果而勿強。\n"
                        "    物壯則老，是謂不道，不道早已。",
                        "    夫兵者，不祥之器，\n"
                        "    物或惡之，故有道者不處。\n"
                        "    君子居則貴左，用兵則貴右。\n"
                        "    兵者不祥之器，非君子之器，\n"
                        "    不得已而用之，恬淡為上。\n"
                        "    勝而不美，而美之者，是樂殺人。\n"
                        "    夫樂殺人者，則不可得志於天下矣。\n"
                        "    吉事尚左，凶事尚右。\n"
                        "    偏將軍居左，上將軍居右，言以喪禮處之。\n"
                        "    殺人之眾，以悲哀泣之，戰勝以喪禮處之。",
                        "    道常無名樸。\n"
                        "    雖小，天下莫能臣。\n"
                        "    侯王若能守之，萬物將自賓。\n"
                        "    天地相合，以降甘露，民莫之令而自均。\n"
                        "    始制有名，名亦既有，\n"
                        "    夫亦將知止，知止可以不殆。\n"
                        "    譬道之在天下，猶川穀之於江海。",
                        "    知人者智，自知者明。\n"
                        "    勝人者有力，自勝者強。\n"
                        "    知足者富。\n"
                        "    強行者有志。\n"
                        "    不失其所者久。\n"
                        "    死而不亡者壽。",
                        "    大道泛兮，其可左右。\n"
                        "    萬物恃之以生而不辭，功成而不有。\n"
                        "    衣養萬物而不為主，可名於小﹔\n"
                        "    萬物歸焉而不為主，可名為大。\n"
                        "    以其終不自為大，故能成其大。",
                        "    執大象，天下往。\n"
                        "    往而不害，安平泰。\n"
                        "    樂與餌，過客止。\n"
                        "    道之出口，淡乎其無味，\n"
                        "    視之不足見，聽之不足聞，用之不足既。",
                        "    將欲歙之，必故張之﹔將欲弱之，必故強之﹔\n"
                        "    將欲廢之，必故興之﹔將欲取之，必故與之。\n"
                        "    是謂微明。\n"
                        "    柔弱勝剛強。\n"
                        "    魚不可脫於淵，國之利器不可以示人。",
                        "    道常無為而無不為。\n"
                        "    侯王若能守之，萬物將自化。\n"
                        "    化而欲作，吾將鎮之以無名之樸。\n"
                        "    鎮之以無名之樸，夫將不欲。\n"
                        "    不欲以靜，天下將自正。",
                        "    上德不德，是以有德﹔\n"
                        "    下德不失德，是以無德。\n"
                        "    上德無為而無以為﹔\n"
                        "    下德無為而有以為。\n"
                        "    上仁為之而無以為﹔\n"
                        "    上義為之而有以為。\n"
                        "    上禮為之而莫之應，\n"
                        "    則攘臂而扔之。\n"
                        "    故失道而後德，失德而後仁，\n"
                        "    失仁而後義，失義而後禮。\n"
                        "    夫禮者，忠信之薄，而亂之首。\n"
                        "    前識者，道之華，而愚之始。\n"
                        "    是以大丈夫處其厚，不居其薄﹔\n"
                        "    處其實，不居其華。故去彼取此。",
                        "    昔之得一者：\n"
                        "    天得一以清﹔\n"
                        "    地得一以寧﹔\n"
                        "    神得一以靈﹔\n"
                        "    谷得一以生﹔\n"
                        "    侯得一以為天下正。\n"
                        "    其致之也，謂天無以清，將恐裂﹔\n"
                        "    地無以寧，將恐廢﹔\n"
                        "    神無以靈，將恐歇﹔\n"
                        "    谷無以盈，將恐竭﹔\n"
                        "    萬物無以生，將恐滅﹔\n"
                        "    侯王無以正，將恐蹶。\n"
                        "    故貴以賤為本，高以下為基。\n"
                        "    是以侯王自稱孤、寡、不穀。\n"
                        "    此非以賤為本邪。非乎。故致譽無譽。\n"
                        "    是故不欲琭琭如玉，珞珞如石。",
                        "    反者道之動﹔弱者道之用。\n"
                        "    天下萬物生於有，有生於無。",
                        "    上士聞道，勤而行之﹔中士聞道，若存若亡﹔\n"
                        "    下士聞道，大笑之。不笑不足以為道。\n"
                        "    故建言有之：\n"
                        "    明道若昧﹔\n"
                        "    進道若退﹔\n"
                        "    夷道若纇﹔\n"
                        "    上德若谷﹔\n"
                        "    廣德若不足﹔\n"
                        "    建德若偷﹔\n"
                        "    質真若渝﹔\n"
                        "    大白若辱﹔\n"
                        "    大方無隅﹔\n"
                        "    大器晚成﹔\n"
                        "    大音希聲﹔\n"
                        "    大象無形﹔\n"
                        "    道隱無名。\n"
                        "    夫唯道，善貸且成。",
                        "    道生一，一生二，二生三，三生萬物。\n"
                        "    萬物負陰而抱陽，衝氣以為和。\n"
                        "    人之所惡，唯孤、寡、不穀，而王公以為稱。\n"
                        "    故物或損之而益，或益之而損。\n"
                        "    人之所教，我亦教之。\n"
                        "    強梁者不得其死，吾將以為教父。",
                        "    天下之至柔，馳騁天下之至堅。\n"
                        "    無有入無間，吾是以知無為之有益。\n"
                        "    不言之教，無為之益，天下希及之。",
                        "    名與身孰親。身與貨孰多。得與亡孰病。\n"
                        "    甚愛必大費﹔多藏必厚亡。\n"
                        "    故知足不辱，知止不殆，可以長久。",
                        "    大成若缺，其用不弊。\n"
                        "    大盈若衝，其用不窮。\n"
                        "    大直若屈，大巧若拙，大辯若訥。\n"
                        "    靜勝躁，寒勝熱。清靜為天下正。",
                        "    天下有道，卻走馬以糞。\n"
                        "    天下無道，戎馬生於郊。\n"
                        "    禍莫大於不知足﹔咎莫大於欲得。\n"
                        "    故知足之足，常足矣。",
                        "    不出戶，知天下﹔不窺牖，見天道。\n"
                        "    其出彌遠，其知彌少。\n"
                        "    是以聖人不行而知，不見而明，不為而成。",
                        "    為學日益，為道日損。\n"
                        "    損之又損，以至於無為。\n"
                        "    無為而無不為。\n"
                        "    取天下常以無事，及其有事，不足以取天下。",
                        "    聖人常無心，以百姓心為心。\n"
                        "    善者，吾善之﹔不善者，吾亦善之﹔德善。\n"
                        "    信者，吾信之﹔不信者，吾亦信之﹔德信。\n"
                        "    聖人在天下，歙歙焉，為天下渾其心，\n"
                        "    百姓皆注其耳目，聖人皆孩之。",
                        "    出生入死。\n"
                        "    生之徒，十有三﹔\n"
                        "    死之徒，十有三﹔\n"
                        "    人之生，動之於死地，亦十有三。\n"
                        "    夫何故。\n"
                        "    以其生之厚。\n"
                        "    蓋聞善攝生者，路行不遇兕虎，入軍不被甲兵﹔\n"
                        "    兕無所投其角，虎無所用其爪，兵無所容其刃。\n"
                        "    夫何故。以其無死地。",
                        "    道生之，德畜之，物形之，勢成之。\n"
                        "    是以萬物莫不尊道而貴德。\n"
                        "    道之尊，德之貴，夫莫之命而常自然。\n"
                        "    故道生之，德畜之﹔\n"
                        "    長之育之﹔成之熟之﹔養之覆之。\n"
                        "    生而不有，為而不恃，\n"
                        "    長而不宰。是謂玄德。",
                        "    天下有始，以為天下母。\n"
                        "    既得其母，以知其子，\n"
                        "    復守其母，沒身不殆。\n"
                        "    塞其兌，閉其門，終身不勤。\n"
                        "    開其兌，濟其事，終身不救。\n"
                        "    見小曰明，守柔曰強。\n"
                        "    用其光，復歸其明，無遺身殃﹔是為襲常。",
                        "    使我介然有知，行於大道，唯施是畏。\n"
                        "    大道甚夷，而人好徑。\n"
                        "    朝甚除，田甚蕪，倉甚虛﹔\n"
                        "    服文采，帶利劍，厭飲食，\n"
                        "    財貨有餘﹔是為盜誇。\n"
                        "    非道也哉。",
                        "    善建者不拔，\n"
                        "    善抱者不脫，子孫以祭祀不輟。\n"
                        "    修之於身，其德乃真﹔\n"
                        "    修之於家，其德乃餘﹔\n"
                        "    修之於鄉，其德乃長﹔\n"
                        "    修之於邦，其德乃豐﹔\n"
                        "    修之於天下，其德乃普。\n"
                        "    故以身觀身，\n"
                        "    以家觀家，以鄉觀鄉，\n"
                        "    以邦觀邦，以天下觀天下。\n"
                        "    吾何以知天下然哉。以此。",
                        "    含「德」之厚，比於赤子。\n"
                        "    毒蟲不螫，猛獸不據，攫鳥不搏。\n"
                        "    骨弱筋柔而握固。\n"
                        "    未知牝牡之合而峻作，精之至也。\n"
                        "    終日號而不嗄，和之至也。\n"
                        "    知和曰「常」，\n"
                        "    知常曰「明」。\n"
                        "    益生曰祥。心使氣曰強。\n"
                        "    物壯則老，謂之不道，不道早已。",
                        "    知者不言，言者不知。\n"
                        "    挫其銳，解其紛，和其光，\n"
                        "    同其塵，是謂「玄同」。\n"
                        "    故不可得而親，不可得而疏﹔\n"
                        "    不可得而利，不可得而害﹔\n"
                        "    不可得而貴，不可得而賤。故為天下貴。",
                        "    以正治國，以奇用兵，以無事取天下。\n"
                        "    吾何以知其然哉。以此：\n"
                        "    天下多忌諱，而民彌貧﹔\n"
                        "    人多利器，國家滋昏﹔\n"
                        "    人多伎巧，奇物滋起﹔\n"
                        "    法令滋彰，盜賊多有。\n"
                        "    故聖人云：\n"
                        "    「我無為，而民自化﹔\n"
                        "    我好靜，而民自正﹔\n"
                        "    我無事，而民自富﹔\n"
                        "    我無慾，而民自樸。」",
                        "    其政悶悶，其民淳淳﹔\n"
                        "    其政察察，其民缺缺。\n"
                        "    是以聖人方而不割，廉而不劌，\n"
                        "    直而不肆，光而不耀。\n"
                        "    禍兮福之所倚，福兮禍之所伏。\n"
                        "    孰知其極。其無正也。\n"
                        "    正復為奇，善復為妖。\n"
                        "    人之迷，其日固久。",
                        "    治人事天，莫若嗇。\n"
                        "    夫唯嗇，是謂早服﹔\n"
                        "    早服謂之重積德﹔重積德則無不克﹔\n"
                        "    無不克則莫知其極﹔莫知其極，可以有國﹔\n"
                        "    有國之母，可以長久﹔\n"
                        "    是謂深根固柢，長生久視之道。",
                        "    治大國，若烹小鮮。\n"
                        "    以道蒞天下，其鬼不神﹔\n"
                        "    非其鬼不神，其神不傷人﹔\n"
                        "    非其神不傷人，聖人亦不傷人。\n"
                        "    夫兩不相傷，故德交歸焉。",
                        "    大邦者下流，天下之牝，\n"
                        "    天下之交也。\n"
                        "    牝常以靜勝牡，以靜為下。\n"
                        "    故大邦以下小邦，則取小邦﹔\n"
                        "    小邦以下大邦，則取大邦。\n"
                        "    故或下以取，或下而取。\n"
                        "    大邦不過欲兼畜人，小邦不過欲入事人。\n"
                        "    夫兩者各得所欲，大者宜為下。",
                        "    道者萬物之奧。善人之寶，不善人之所保。\n"
                        "    美言可以市尊，美行可以加人。\n"
                        "    人之不善，何棄之有。\n"
                        "    故立天子，置三公，\n"
                        "    雖有拱璧以先駟馬，\n"
                        "    不如坐進此道。\n"
                        "    古之所以貴此道者何。\n"
                        "    不曰：求以得，有罪以免邪。故為天下貴。",
                        "    為無為，事無事，味無味。\n"
                        "    圖難於其易，為大於其細﹔\n"
                        "    天下難事，必作於易，\n"
                        "    天下大事，必作於細。\n"
                        "    是以聖人終不為大，故能成其大。\n"
                        "    夫輕諾必寡信，多易必多難。\n"
                        "    是以聖人猶難之，故終無難矣。",
                        "    其安易持，其未兆易謀。\n"
                        "    其脆易泮，其微易散。\n"
                        "    為之於未有，治之於未亂。\n"
                        "    合抱之木，生於毫末﹔\n"
                        "    九層之臺，起於累土﹔\n"
                        "    千里之行，始於足下。\n"
                        "    民之從事，常於幾成而敗之。\n"
                        "    慎終如始，則無敗事。",
                        "    古之善為道者，非以明民，將以愚之。\n"
                        "    民之難治，以其智多。\n"
                        "    故以智治國，國之賊﹔\n"
                        "    不以智治國，國之福。\n"
                        "    知此兩者亦稽式。\n"
                        "    常知稽式，是謂「玄德」。\n"
                        "    「玄德」深矣，遠矣，與物反矣，然後乃至大順。",
                        "    江海之所以能為百谷王者，\n"
                        "    以其善下之，故能為百谷王。\n"
                        "    是以聖人慾上民，必以言下之﹔\n"
                        "    欲先民，必以身後之。\n"
                        "    是以聖人處上而民不重，處前而民不害。\n"
                        "    是以天下樂推而不厭。\n"
                        "    以其不爭，故天下莫能與之爭。",
                        "    天下皆謂我道大，似不肖。\n"
                        "    夫唯大，故似不肖。\n"
                        "    若肖，久矣其細也夫。\n"
                        "    我有三寶，持而保之。\n"
                        "    一曰慈，\n"
                        "    二曰儉，\n"
                        "    三曰不敢為天下先。\n"
                        "    慈故能勇﹔儉故能廣﹔\n"
                        "    不敢為天下先，故能成器長。\n"
                        "    今舍慈且勇﹔舍儉且廣﹔\n"
                        "    舍後且先﹔死矣。\n"
                        "    夫慈以戰則勝，以守則固。\n"
                        "    天將救之，以慈衛之。",
                        "    善為士者，不武﹔\n"
                        "    善戰者，不怒﹔\n"
                        "    善勝敵者，不與﹔\n"
                        "    善用人者，為之下。\n"
                        "    是謂不爭之德，\n"
                        "    是謂用人之力，\n"
                        "    是謂配天古之極。",
                        "    用兵有言：\n"
                        "    「吾不敢為主，而為客﹔\n"
                        "    不敢進寸，而退尺。」\n"
                        "    是謂行無行﹔攘無臂﹔\n"
                        "    扔無敵﹔執無兵。\n"
                        "    禍莫大於輕敵，輕敵幾喪吾寶。\n"
                        "    故抗兵相若，哀者勝矣。",
                        "    吾言甚易知，甚易行。\n"
                        "    天下莫能知，莫能行。\n"
                        "    言有宗，事有君。\n"
                        "    夫唯無知，是以不我知。\n"
                        "    知我者希，則我者貴。\n"
                        "    是以聖人被褐而懷玉。",
                        "    知不知，尚矣﹔不知知，病也。\n"
                        "    聖人不病，以其病病。\n"
                        "    夫唯病病，是以不病。",
                        "    民不畏威，\n"
                        "    則大威至。\n"
                        "    無狎其所居，\n"
                        "    無厭其所生。\n"
                        "    夫唯不厭，\n"
                        "    是以不厭。\n"
                        "    是以聖人自知不自見﹔\n"
                        "    自愛不自貴。\n"
                        "    故去彼取此。",
                        "    勇於敢則殺，勇於不敢則活。\n"
                        "    此兩者，或利或害。\n"
                        "    天之所惡，孰知其故。\n"
                        "    天之道，\n"
                        "    不爭而善勝，不言而善應，\n"
                        "    不召而自來，繟然而善謀。\n"
                        "    天網恢恢，疏而不失。",
                        "    民不畏死，奈何以死懼之。\n"
                        "    若使民常畏死，而為奇者，\n"
                        "    吾得執而殺之，孰敢。\n"
                        "    常有司殺者殺。\n"
                        "    夫代司殺者殺，是謂代大匠斲，\n"
                        "    夫代大匠斲者，希有不傷其手矣。",
                        "    民之飢，以其上食稅之多，是以飢。\n"
                        "    民之難治，以其上之有為，是以難治。\n"
                        "    民之輕死，以其上求生之厚，是以輕死。\n"
                        "    夫唯無以生為者，是賢於貴生。",
                        "    人之生也柔弱，其死也堅強。\n"
                        "    草木之生也柔脆，其死也枯槁。\n"
                        "    故堅強者死之徒，柔弱者生之徒。\n"
                        "    是以兵強則滅，木強則折。\n"
                        "    強大處下，柔弱處上。",
                        "    天之道，其猶張弓歟。\n"
                        "    高者抑之，下者舉之﹔\n"
                        "    有餘者損之，不足者補之。\n"
                        "    天之道，損有餘而補不足。\n"
                        "    人之道，則不然，損不足以奉有餘。\n"
                        "    孰能有餘以奉天下，唯有道者。\n"
                        "    是以聖人為而不恃，功成而不處，其不欲見賢。",
                        "    天下莫柔弱於水，而攻堅強者莫之能勝，以其無以易之。\n"
                        "    弱之勝強，柔之勝剛，\n"
                        "    天下莫不知，莫能行。\n"
                        "    是以聖人云：\n"
                        "    「受國之垢，是謂社稷主﹔\n"
                        "    受國不祥，是為天下王。」\n"
                        "    正言若反。",
                        "    和大怨，必有餘怨﹔\n"
                        "    報怨以德，安可以為善。\n"
                        "    是以聖人執左契，而不責於人。\n"
                        "    有德司契，無德司徹。\n"
                        "    天道無親，常與善人。",
                        "    小國寡民。\n"
                        "    使有什伯之器而不用﹔\n"
                        "    使民重死而不遠徙。\n"
                        "    雖有舟輿，無所乘之，\n"
                        "    雖有甲兵，無所陳之。\n"
                        "    使民復結繩而用之。\n"
                        "    甘其食，美其服，安其居，樂其俗。\n"
                        "    鄰國相望，雞犬之聲相聞，\n"
                        "    民至老死，不相往來。",
                        "    信言不美，美言不信。\n"
                        "    善者不辯，辯者不善。\n"
                        "    知者不博，博者不知。\n"
                        "    聖人不積，既以為人己愈有，\n"
                        "    既以與人己愈多。\n"
                        "    天之道，利而不害﹔\n"
                        "    聖人之道，為而不爭。"
                        })
        ])
});

mapping *book_sk = ({
        ([  "name"              :       "陰符經",
                "lv"            :       320,
                "content"       :       ({
                        "    觀天之道，執天之行，盡矣。\n"
                        "    故天有五賊，見之者昌。\n"
                        "    五賊在心，施行於天。\n"
                        "    宇宙在乎手，萬化生乎身。",
                        "    天性，人也；人心，機也。\n"
                        "    立天之道，以定人也。\n"
                        "    天發殺機，移星易宿；\n"
                        "    地發殺機，龍蛇起陸；\n"
                        "    人發殺機，天地反覆；\n"
                        "    天人合發，萬化定基。",
                        "    性有巧拙，可以伏藏。\n"
                        "    九竅之邪，在乎三要，可以動靜。\n"
                        "    火生於木，禍發必克；\n"
                        "    奸生於國，時動必潰。\n"
                        "    知之修之，謂之聖人。 ",
                        "    天生天殺，道之理也。\n"
                        "    天地，萬物之盜；\n"
                        "    萬物，人之盜；\n"
                        "    人，萬物之盜。\n"
                        "    三盜既宜，三才即安。",
                        "    故曰：\n"
                        "    食其時，百骸理；\n"
                        "    動其機，萬化安。\n"
                        "    人知其神之神，\n"
                        "    不知其不神之所以神也。",
                        "    日月有數，大小有定，\n"
                        "    聖功生焉，神明出焉。\n"
                        "    其盜機也，天下莫能見，莫能知。\n"
                        "    君子得之固窮，小人得之輕命。 ",
                        "    瞽者善聽，聾者善視。\n"
                        "    絕利一源，用師十倍。\n"
                        "    三返晝夜，用師萬倍。",
                        "    心生於物，死於物，機在於目。\n"
                        "    天之無恩而大恩生。\n"
                        "    迅雷烈風，莫不蠢然。\n"
                        "    至樂性餘，至靜性廉。\n"
                        "    天之至私，用之至公。",
                        "    禽之制在炁。生者死之根，死者生之根。\n"
                        "    恩生於害，害生於恩。\n"
                        "    愚人以天地文理聖，我以時物文理哲。\n"
                        "    人以愚虞聖，我以不愚虞聖；\n"
                        "    人以奇期勝，我以不奇期勝。",
                        "    故曰：\n"
                        "    沉水入火，自取滅亡。\n"
                        "    自然之道靜，故天地萬物生。\n"
                        "    天地之道浸，故陰陽勝。\n"
                        "    陰陽推，而變化順矣。",
                        "    是故聖人知自然之道不可違，因而制之，至靜之道。\n"
                        "    律歷所不能契。\n"
                        "    爰有奇器，是生萬象，八卦甲子，神機鬼藏。\n"
                        "    陰陽相勝之術，昭昭乎進於象矣。"
                        })
        ]),
        ([  "name"              :       "外景經",
                "lv"            :       360,
                "content"       :       ({
                        "    老君閒居作七言，解說身形及諸神，上有黃庭下關元，後有幽闕前命門",
                        "    呼吸廬間入丹田，玉池清水灌靈根，審能修之可長存，黃庭中人衣朱衣",
                        "    關元茂龠闔兩靡，幽闕俠之高巍巍，丹田之中精氣微，玉池清水上生肥",
                        "    靈根堅固老不衰，中池有士服赤衣，橫下三寸神所居，中外相距重閉之",
                        "    神廬之中當修治，玄府氣管受精府，急固子精以自持，宅中有士常衣繹",
                        "    子能見之可不病，橫立長尺約其上，子能守之或無惹，呼吸廬間以自償",
                        "    子保完堅身受慶，方寸之中謹蓋藏，精神還歸老復壯，心結幽厥流下競",
                        "    養子玉樹令可壯，至道不煩無旁午，靈臺通天臨中野，方寸之中間關下",
                        "    玉房之中神門戶，既是公子教我者，明堂四達法海源，真人子丹當吾前",
                        "    三關之中精氣深，子欲不死修崑崙，繹官重樓十二環，瓊室之中五色集",
                        "    赤神之子中池立，下有長城玄谷邑，長生要慎房中急，棄捐淫慾專子精",
                        "    寸田尺宅可治生，系子長留心安寧，推志遊神三奇靈，行間無事心太平",
                        "    常存玉房神明達，時思太倉不飢渴，役使六丁玉女渴，閉子精門可長活",
                        "    正室堂前神所舍，洗心自治無敗汙，歷觀五臟視節度，六府修治潔如素",
                        "    虛無自然道之固，物有自然道不煩，垂拱無為身體安，虛無之居在幃間",
                        "    寂寞郭然口不言，修和獨立真人官，恬淡無欲遊德園，清淨香潔玉女前",
                        "    作道優遊深獨居，扶養性命守虛無，恬淡自樂何思慮，羽翼已具正扶疏",
                        "    長生久視乃飛去，五行參差同根蒂，三五合氣其本一，誰與共之鬥日月",
                        "    抱玉懷珠和子室，子能守一萬事畢，子自有之持無失，即欲不死入金室",
                        "    出日大月是吾道，天七地三回相守，升降進退合乃久，玉石落落是吾寶",
                        "    子自有之何不守，心曉根基養華彩，服天順地合藏精，七口之五回相合",
                        "    崑崙之上不迷誤，九原之山何亭亭，中有真人可使令，蔽以紫官舟城樓",
                        "    俠以日月如明珠，萬歲昭昭非有期，外本三陽物自來，內拘三神可長生",
                        "    魂欲上天魄入淵，還魂返魄道自然，庶幾結珠固靈根，玉匙金鑰身完堅",
                        "    載地懸天周乾坤，象以四時赤如舟，前仰後卑列其門，選以還丹與玄泉",
                        "    象龜引氣致靈根，中有真人巾金巾，負甲持符開七門，此非扶葉實是根",
                        "    晝夜忌之可長存，仙人造士非異有，積精所致和專仁，人皆食谷與五味",
                        "    獨食太和陰陽氣，故能不死天相既，試說五臟各有方，心為國主五臟王",
                        "    受意動靜氣得行，道自將我神明光，晝日昭昭夜自守，渴可得漿飢自飽",
                        "    經歷六府藏卯酉，通我精華調陰陽，轉陽之陰藏於九，常能行之耳不老",
                        "    肝之為氣修而長，羅列五臟主三光，上合三焦下玉漿，我神玖魄在中央",
                        "    精液流泉去鼻香，立於玄膺含明堂，雷電霹靂往相聞，右酉左卯是吾室",
                        "    伏於志門侯天道，近在子身還自守，清靜無為神留止，精神上下開分理",
                        "    精候天道長生草，七竅已通不知老，還坐天門侯陰陽，下於喉嚨神明通",
                        "    過華蓋下清且涼，大清靈淵見吾形，期成還年可長生，還過華池動腎精",
                        "    立於明堂望丹田，將使諸神開命門，通利天道存靈根，陰陽列布若流星",
                        "    肝氣周還終無端，肺之為氣三焦起，上座天門侯故道，津液醴泉通六府",
                        "    隨鼻上下開兩耳，窺視天地存童子，調和精華治發齒，顏色光澤不復白",
                        "    下於喉嚨何落落，諸神皆會相求索，下大絳宮紫華色，隱藏華蓋觀通廬",
                        "    專守心神轉相呼，觀我神明闢諸邪，脾神還歸依大家，致於胃管通虛無",
                        "    藏養靈根不復枯，閉塞命門如玉都，壽傳萬歲年有餘，脾中之神主中官",
                        "    朝會五臟列三光，上合天門合明堂，通利六府調五行，金木水火土為王",
                        "    通利止脈汗為漿，修護七竅去不祥，二神相待化玉英，上稟天氣命益長",
                        "    日月列布張陰陽，五臟之主腎最精，伏於太陰成吾形，出入二竅合黃庭",
                        "    呼吸虛無見吾形，強我筋骨血脈盛，恍惚不見過青靈，坐於廬下幾小童",
                        "    內息思存神明光，出於天門大無閒，恬淡無欲養華莖，服食玄氣可遂生",
                        "    還返七門飲太淵，通我懸膺過青靈，坐於膺間見小童，問於仙迂與奇方",
                        "    服食芝草紫華英，頭戴白素足丹田，沐浴華池生靈根，三府相得開命門",
                        "    五味皆至善氣還，披髮行之可長存，大道蕩蕩心勿煩，吾言畢矣勿妄傳"
                        })
        ]),
        ([  "name"              :       "內景經",
                "lv"            :       420,
                "content"       :       ({
                        "    上清紫霞虛皇前，太上大道玉晨君\n"
                        "    閒居蕊珠作七言，散化五形變萬神\n"
                        "    是為黃庭曰內篇，琴心三疊舞胎仙\n"
                        "    九氣映明出霄間，神蓋童子生紫煙\n"
                        "    是曰玉書可精研，詠之萬過升三天\n"
                        "    千災以消百病痊，不憚虎狼之兇殘\n"
                        "    亦以卻老年永延",
                        "    上有魂靈下關元，左為少陽右太陰\n"
                        "    後有密戶前生門，出日入月呼吸存\n"
                        "    四氣所合列宿分，紫煙上下三素雲\n"
                        "    灌溉五華植靈根，七液洞流衝廬間\n"
                        "    迥紫抱黃入丹田，幽室內明照陽明",
                        "    口為玉池太和官，漱咽靈液災不幹\n"
                        "    體生光華氣香蘭，卻滅百邪玉煉顏\n"
                        "    審能修之登廣寒，晝夜不寐乃成真\n"
                        "    雷鳴電激神泯泯",
                        "    黃庭內人服錦衣，紫華飛裙雲氣羅\n"
                        "    丹青綠條翠靈柯，七蕤玉龠閉兩扉\n"
                        "    重扇金關密樞機，玄泉幽關高崔危\n"
                        "    三田之中精氣微，嬌女窈窕翳霄暉\n"
                        "    重堂煥煥明八威，天庭地關列斧斤\n"
                        "    靈臺盤固永不衰",
                        "    中池內神服赤珠，丹錦雲袍帶虎符\n"
                        "    橫津三寸靈所居，隱芝翳鬱自相扶",
                        "    天中之嶽精謹修，雲宅既清玉帝遊\n"
                        "    通利道路無終休，眉號華蓋覆明珠\n"
                        "    九幽日月洞空無，宅中有真常衣丹\n"
                        "    審能見之無疾患，赤珠靈裙華茜粲\n"
                        "    舌下玄膺生死岸，出青入玄二氣煥\n"
                        "    子若遇之昇天漢",
                        "    至道不煩決存真，泥丸百節皆有神\n"
                        "    發神蒼華字太元，腦神精根字泥丸\n"
                        "    眼神明上字英玄，鼻神玉壟字靈堅\n"
                        "    耳神空閒字幽田，舌神通命字正倫\n"
                        "    齒神峭鋒字羅千，一面之神宗泥丸\n"
                        "    泥丸九真皆有房，方圓一寸處此中\n"
                        "    同服紫衣飛羅裳，但思一部壽無窮\n"
                        "    非各別住俱腦中，列位次坐向外方\n"
                        "    所存在心自相當",
                        "    心神丹元字守靈，肺神皓華字虛成\n"
                        "    肝神龍煙字含明，翳鬱導煙主濁清\n"
                        "    腎神玄冥字育嬰，脾神常在字魂停\n"
                        "    膽神龍曜字威明，六腑五藏神體精\n"
                        "    皆在心內運天經，晝夜存之自長生",
                        "    肺部之宮似華蓋，下有童子坐玉闕\n"
                        "    七元之子主調氣，外應中嶽鼻齊位\n"
                        "    素錦衣裳黃雲帶，喘息呼吸體不快\n"
                        "    急存白元和六氣，神仙久視無災害\n"
                        "    用之不已形不滯",
                        "    心部之宮蓮含華，下有童子丹元家\n"
                        "    主適寒熱榮衛和，丹錦衣裳披玉羅\n"
                        "    金鈴朱帶坐婆娑，調血理命身不枯\n"
                        "    外應口舌吐五華，臨絕呼之亦登蘇\n"
                        "    久久行之飛太霞",
                        "    肝部之中翠重裡，下有青童神公子\n"
                        "    主諸關鍵聰明始，青錦披裳佩玉鈴\n"
                        "    和制魂魄津液平，外應眼目日月清\n"
                        "    百痾所鍾存無英，同用七日自充盈\n"
                        "    垂絕念神死復生，攝魂還魄永無傾",
                        "    腎部之宮玄闕圓，中有童子冥上玄\n"
                        "    主諸六府九液源，外應兩耳百液津\n"
                        "    蒼錦雲衣舞龍幡，上致明霞日月煙\n"
                        "    百病千災急當存，兩部水王對生門\n"
                        "    使人長生升九天",
                        "    脾部之宮屬戊已，中有明童黃裳裡\n"
                        "    消谷散氣攝牙齒，是為太倉兩明童\n"
                        "    坐在金臺城九重，方圓一寸命門中\n"
                        "    主調百穀五味香，闢卻虛羸無病傷\n"
                        "    外應尺宅氣色芳，光華所生以表明\n"
                        "    黃錦玉衣帶虎章，注念三老子輕翔\n"
                        "    長生高仙遠死殃",
                        "    膽部之宮六府精，中有童子曜威明\n"
                        "    雷電八震揚玉旌，龍旗橫天擲火鈴\n"
                        "    主諸氣力攝虎兵，外應眼童鼻柱間\n"
                        "    腦發相扶亦俱鮮，九色錦衣綠華裙\n"
                        "    佩金帶玉龍虎文，能存威明乘慶雲\n"
                        "    役使萬神朝三元",
                        "    脾長一尺掩太倉，中部老君治明堂\n"
                        "    闕字靈元名混康，治人百病消谷糧\n"
                        "    黃衣紫帶龍虎章，長精益命賴君王\n"
                        "    三呼我名神自通，三老同坐各有朋\n"
                        "    或精或胎別執方，桃孩合延生華芒\n"
                        "    男女迥九有桃康，道父道母對相望\n"
                        "    師父師母丹玄鄉，可用存思登虛空\n"
                        "    殊途一會歸要終，關塞三關握固停\n"
                        "    含漱金醴吞玉英，遂至不飢三蟲亡\n"
                        "    心意常和致欣昌，五嶽之雲氣彭亨\n"
                        "    保灌玉廬以自償，五形完堅無災殃",
                        "    上睹三元如連珠，落落明景照九隅\n"
                        "    五靈夜燭煥八區，子存內皇與我遊\n"
                        "    身披鳳衣銜虎符，一至不久升虛無\n"
                        "    方寸之中念深藏，不方不圓閉牖窗\n"
                        "    三神還精老方壯，魂魄內守不爭競\n"
                        "    神生腹中銜玉當，靈注幽闕那得喪\n"
                        "    琳條萬尋可蔭仗，三魂自寧帝書",
                        "    靈臺鬱藹望黃野，三寸異室有上下\n"
                        "    間關營衛高玄受，洞房紫極靈門戶\n"
                        "    是昔太上告我者，左神公子發神語\n"
                        "    右有白元並立處，明堂金匱玉房間\n"
                        "    上清真人當吾前，黃裳子丹氣頻煩\n"
                        "    借問何在兩眉端，內俠日月列宿陳\n"
                        "    七曜九元冠生門",
                        "    三關之中精氣深，九微之內幽且陰\n"
                        "    口為心關精神機，足為地關生命棐\n"
                        "    手為人關把盛衰",
                        "    若得三宮存玄丹，太一流珠安崑崙\n"
                        "    重重樓閣十二環，自高自下皆真人\n"
                        "    玉堂絳宇盡玄宮，璇璣玉衡色蘭開\n"
                        "    瞻望童子坐盤桓，問誰家子在我身\n"
                        "    此人何去入泥丸，千千百百自相連\n"
                        "    一一十十似重山，雲儀玉華俠耳門\n"
                        "    赤帝黃老與己魂，三真扶胥共房津\n"
                        "    五斗煥明是七元，日月飛行六合間\n"
                        "    帝鄉天中地戶端，面部魂神皆相存",
                        "    呼吸元氣以求仙，仙公公子已在前\n"
                        "    朱鳥吐縮白石源，結精育胞化生身\n"
                        "    留胎止精可長生，三氣右回九道明\n"
                        "    正一含華乃充盈，遙望一心如羅星\n"
                        "    金室之下可不傾，延我白首反孩嬰",
                        "    瓊室之中八素集，泥丸夫人當中立\n"
                        "    長谷玄鄉繞效邑，六龍散飛難分別\n"
                        "    長生至慎房中急，何為死作令神泣\n"
                        "    忽之禍鄉三靈歿，但當吸氣錄子精\n"
                        "    寸田尺宅可治生，若當決海百瀆傾\n"
                        "    葉去樹枯失青青，氣亡液漏非己形\n"
                        "    專閉御景乃長寧，保我泥丸三奇靈\n"
                        "    恬淡閉視內自明，物物不幹泰而平\n"
                        "    意矣匪事老復丁，思詠玉書入上清",
                        "    常念三房相通達，洞得視見無內外\n"
                        "    存漱五牙不飢渴，神華執巾六丁謁\n"
                        "    急守精室勿妄洩，閉而寶之可長活\n"
                        "    起自形中初不闊，三官近在易隱括\n"
                        "    虛無寂寂空中索，使形如是不當汙\n"
                        "    九室正虛神明舍，存思百念視節度\n"
                        "    六府修治勿令故，行自翱翔入天路",
                        "    治生之道了不煩，但修洞玄與玉篇\n"
                        "    兼行形中八景神，二十四真出自然\n"
                        "    高拱無為魂魄安，清淨神見與我言\n"
                        "    安在紫房幃幙間，立坐室外三五玄\n"
                        "    燒香接手玉華前，共入太室璇璣門\n"
                        "    高研恬淡道之園，內視密盼盡睹真\n"
                        "    真人在己莫問鄰，何處遠索求因緣",
                        "    隱形滅形與世殊，含氣養精口如朱\n"
                        "    帶執性命守虛無，名入上清死錄除\n"
                        "    三神之樂由隱居，倏欻遊遨無遺憂\n"
                        "    羽服一整八風驅，控駕三素乘晨霞\n"
                        "    金輦正立從玉輿，何不登山誦我書\n"
                        "    鬱鬱窈窕真人墟，入山何難故躊躇\n"
                        "    人間紛紛臭帤如",
                        "    五行相推反歸一，三五合氣九九節\n"
                        "    可用隱地回八術，伏牛幽闕羅品列\n"
                        "    三明出華生死際，洞房靈象鬥日月\n"
                        "    父曰泥丸母雌一，三光煥照入子室\n"
                        "    能存玄真萬事畢，一身精神不可失",
                        "    高奔日月吾上道，鬱儀結璘善相保\n"
                        "    乃見玉清虛無老，可以回顏填血腦\n"
                        "    口銜靈芒攜五皇，腰帶虎籙佩金璫\n"
                        "    駕欻接生宴東蒙",
                        "    玄元上一魂魄煉，一之為物叵卒見\n"
                        "    須得至真始顧盼，至忌死氣諸穢澀\n"
                        "    六神合集虛中宴，結珠固精養神根\n"
                        "    玉匙金龠常完堅，閉口屈舌食胎津\n"
                        "    使我遂煉獲飛仙",
                        "    仙人道士非有神，積精累氣以為真\n"
                        "    黃童妙音難可聞，玉書絳簡赤丹文\n"
                        "    字曰真人巾金巾，負甲持符開七門\n"
                        "    火兵符圖備靈關，前昂後卑高下陳\n"
                        "    執劍百丈舞錦幡，十絕盤空扇紛壇\n"
                        "    火鈴冠霄隊落煙，安在黃闕兩眉間\n"
                        "    此非枝葉實是根",
                        "    紫清上皇太道君，太玄太和俠侍端\n"
                        "    化生萬物使我仙，飛昇十天駕玉輪\n"
                        "    晝夜七日思勿眠，子能行此可長存\n"
                        "    積功成煉非自然，是由精誠亦由專\n"
                        "    內守堅固真之真，虛中恬淡自致神",
                        "    百穀之實土地精，五味外美邪魔腥\n"
                        "    臭亂神明胎氣零，那從反老得還嬰\n"
                        "    三魂忽忽魄糜傾，何不食氣太和精\n"
                        "    故能不死入黃寧",
                        "    心典一體五藏王，動靜念之道德行\n"
                        "    清潔喜氣自明光，坐起吾俱共棟樑\n"
                        "    晝日曜景暮閉藏，通利華精調陰陽",
                        "    經歷六合隱卯酉，兩腎之神主延壽\n"
                        "    轉降適鬥藏初九，知雄守雌可無老\n"
                        "    知白見黑急坐守",
                        "    肝氣鬱勃清且長，羅列六府生三光\n"
                        "    心精意專內不傾，上合三焦下玉漿\n"
                        "    玄液雲行去臭香，治蕩發齒煉五方\n"
                        "    取津玄膺入明堂，下溉喉嚨神明通\n"
                        "    坐侍華蓋遊貴京，飄颻三帝席清涼\n"
                        "    五色雲氣紛青蔥，閉目內眄自相望\n"
                        "    使心諸神還相崇，七玄英華開命門\n"
                        "    通利天道存玄根，百二十年猶可還\n"
                        "    過此守道誠獨難，唯待九轉八瓊丹\n"
                        "    要復精思存七元，日月之華救老殘\n"
                        "    川氣周流絡無端",
                        "    肺之為氣三焦起，視聽幽冥候童子\n"
                        "    調理五華精發齒，三十六咽玉池裡\n"
                        "    開通百脈血液始，顏色生光金玉澤\n"
                        "    齒堅發黑不知白，存此真神勿落落\n"
                        "    當憶此宮有座席，眾神合會轉相索",
                        "    隱藏羽蓋看天舍，朝拜太陽樂相呼\n"
                        "    明神八威正辟邪，脾神還歸是胃家\n"
                        "    耽養靈根不復枯，閉塞命門保玉都\n"
                        "    萬神方胙壽有餘，是謂脾建在中宮\n"
                        "    五藏六府神明主，上合天門入明堂\n"
                        "    守雌存雄頂三光，外方內圓神在中\n"
                        "    通利血脈五藏豐，骨青筋赤髓如霜\n"
                        "    脾救七竅去不祥，日月列布設陰陽\n"
                        "    兩神相會化玉英，淡然無味天人糧\n"
                        "    子丹進饌餚正黃，乃曰琅膏及玉霜\n"
                        "    太上隱環八素瓊，溉益八液腎受精\n"
                        "    伏於太陰見我形，揚風三玄出始青\n"
                        "    恍惚之間至清靈，坐於飆臺見赤生\n"
                        "    逸域熙真養華榮，內盼沉默煉五形\n"
                        "    三氣徘徊得神明，隱龍遁芝雲琅英\n"
                        "    可以充飢使萬靈，上蓋玄玄下虎章",
                        "    沐浴盛潔棄肥薰，入室東向誦玉篇\n"
                        "    約得萬遍義自鮮，散發無慾以長存\n"
                        "    五味皆至正氣還，夷心寂悶勿煩冤\n"
                        "    過數已華體神精，黃華玉女告子情\n"
                        "    真人既至使六丁，即授隱芝大洞經\n"
                        "    十讀四拜朝太上，先謁太帝后北向\n"
                        "    黃庭內經玉書暢，授者曰師受者盟\n"
                        "    雲錦鳳羅金鈕纏，以代割發肌膚全\n"
                        "    攜手登山歃液丹，金書玉景乃可宣\n"
                        "    傳得可授告三官，勿令七祖受冥患\n"
                        "    太上微言致神仙，不死之道此真文"
                        })
        ])
});


void select_book()
{
        if (query("select_book")) return;
        if (random(100)>33) 
        {
                set("select_book/type", "exp");
                set("select_book/index", random(sizeof(book_exp)));
                set("select_book/name", book_exp[query("select_book/index")]["name"]);
                set("select_book/lv", book_exp[query("select_book/index")]["lv"]);
                set("select_book/count", sizeof(book_exp[query("select_book/index")]["content"]));
        }
        else
        {
                set("select_book/type", "sk");
                set("select_book/index", random(sizeof(book_sk)));
                set("select_book/name", book_sk[query("select_book/index")]["name"]);
                set("select_book/lv", book_sk[query("select_book/index")]["lv"]);
                set("select_book/count", sizeof(book_sk[query("select_book/index")]["content"]));
        }
}

string get_text()
{
        int idx, lastidx;
        lastidx = query("content_idx");
        idx = random(query("select_book/count"));
        while (idx == lastidx) {
                idx = random(query("select_book/count"));
        }
        set("content_idx", idx);
        switch (query("select_book/type"))
        {
                case "exp" :
                        return book_exp[query("select_book/index")]["content"][idx];
                case "sk" :
                        return book_sk[query("select_book/index")]["content"][idx];
                default :
                        return ".^&#!^$&#@!&$#$&&^^$%%&..";
        }
}

void say_text()
{
        string msg = NOR + name() + CYN;
        switch (random(5))
        {
                case 0 :
                        msg += "輕柔念道：";
                        break;
                case 1 :
                        msg += "喃喃講道：";
                        break;
                case 2 :
                        msg += "大聲頌道：";
                        break;
                case 3 :
                        msg += "正聲讀道：";
                        break;
                case 4 :
                        msg += "點頭誦道：";
                        break;
        }
        msg += "\n" + NOR + HIC + get_text() + "\n" + NOR;
        message_vision(msg, this_object());
}

object *babys = ({});

int filter_babys(object me)
{
        if (base_name(me)!="/clone/user/baby") return 0;
        me->save();
        return 1;
}

int load_babys(string roomfile)
{
        object room;
        if (!roomfile) room = environment();
                else room = load_object(roomfile);
        if (!objectp(room))
        {
                room = environment();
        }
        if (!objectp(room))
        {
                babys = ({});
                return 1;
        }
        babys = filter_array(all_inventory(room), (: filter_babys :));
        return 1;
}

int force_babys(string cmds)
{
        object baby;
        int count = sizeof(babys);
        if (!count) return 1;
        while (count--)
        {
                baby = babys[count];
                if (objectp(baby))
                {
                        baby->stop_busy();
                        baby->command(cmds);
                }
        }
        return 1;
}

int drop_baby(object me)
{
        object room;
        if (query_temp("school/pay", me)>0)
        {
                addn_temp("school/pay", TEACH_COIN, me);
                return 1;
        }
        delete_temp("school/pay", me);
        message_vision(append_color(YEL "清潔大媽惡狠狠地衝進來，幾掃帚就把$N打出教室去了...\n" NOR, YEL), me);
        room = load_object("/u/redl/school/caochang");
        if (objectp(room)) {
                me->move(room);
                message_vision(append_color(YEL "$N狼狽不堪地被清潔大媽從教室裡趕了出來。\n" NOR, YEL), me);
        }
        return 0;
}

int drop_baby2(object me)
{
        object room;
        if (query_temp("school/bad", me)<36)
        {
                return 1;
        }
        message_vision(append_color(YEL  "$N正在得意，霎時一個小鈴鐺飛過來把$N直接砸暈。\n" 
                                                                         "清潔大媽和看門大叔溜進來，小心翼翼地把$N抬了出去...\n" NOR, YEL), me);
        room = load_object("/u/redl/school/caochang");
        if (objectp(room)) {
                me->move(room);
                message_vision(append_color(YEL "$N眼冒金星地被大媽大叔從教室裡抬了出來。\n" NOR, YEL), me);
        }
        return 0;
}

int gift_babys()
{
        object baby;
        int count = sizeof(babys);
        int p = query("select_book/lv");
        int flag = 0;
        int rnd;
        
        if (!count) return 1;
        if (query("select_book/type")=="exp") flag = 1;
        while (count--)
        {
                rnd = random(sizeof(listen));
                baby = babys[count];
                if (baby && objectp(baby) && environment(baby)==environment() && drop_baby(baby))
                {
                        if (flag) {
                                if (random(100)>8 && drop_baby2(baby)) call_other("/u/redl/school/caochang", "do_giftbaby", baby, "學習過程中", p);
                                else {
                                        message_vision(append_color(CYN + listen[rnd]["msg"] + NOR, CYN), baby, this_object());
                                        addn_temp("school/bad", listen[rnd]["value"], baby);
                                        drop_baby2(baby);
                                }
                        } else {
                                if (random(100)>16 && drop_baby2(baby)) call_other("/u/redl/school/caochang", "do_giftbaby2", baby, "學習過程中", p);
                                else {
                                        message_vision(append_color(CYN + listen[rnd]["msg"] + NOR, CYN), baby, this_object());
                                        addn_temp("school/bad", listen[rnd]["value"], baby);
                                        drop_baby2(baby);
                                }
                        }
                }
        }
        return 1;
}

//random(sizeof(listen))

int start3(int stp, int idxbaby)
{
        object baby;
        int delay = 0;

        this_object()->start_busy(9);
        switch (stp)
        {
                case 0:
                        message_vision(NOR + name() + "環顧四周一眼道：現在開始點名...\n" NOR, this_object());
                        stp ++;
                        break;
                case 1:
                        if (idxbaby > -1) {
                                baby = babys[idxbaby];
                                if (objectp(baby)) {
                                        this_object()->command("say " + query("name", baby) + (random(2) ? ".." : "？"));
                                        delete_temp("school/bad", baby);
                                        switch (random(8)) 
                                        {
                                                case 0 :
                                                        baby->command("say " + query("name", baby) + "在此！");
                                                        break;
                                                case 1 :
                                                        baby->command("say 來啦。。");
                                                        break;
                                                case 2 :
                                                        baby->command("say 我在這裡。");
                                                        break;
                                                case 3 :
                                                        baby->command("say 是！");
                                                        break;
                                                case 4 :
                                                        baby->command("say Yes, sir..");
                                                        break;
                                                default :
                                                        baby->command("say 到——！");
                                                        break;
                                        }
                                }
                                idxbaby --;
                        }
                        else {
                                stp ++;
                        }
                        break;
                case 2:
                        delete("select_book");
                        select_book();
                        message_vision(NOR + name() + CYN + "點了點頭道：現在開始上課，今天我們講的是《" + HIY + query("select_book/name") + NOR + CYN + "》...\n" + NOR, this_object());
                        stp ++;
                        break;
                case 3:
                        delay = 3;
                        if (query("select_book/read_num")<TEACH_NUM) {
                                addn("select_book/read_num", 1);
                                say_text();
                                gift_babys();
                                break;
                        }
                        stp ++;
                        break;
                case 4:
                        message_vision(NOR "$N輕輕晃動手腕上的鈴鐺說道：今天的課就講到這裡，下課——\n" NOR, this_object());
                        stp ++;
                        break;
                case 5:
                        this_object()->command("say 同學們再見。");
                        this_object()->command("wave");
                        stp ++;
                        break;
                case 6:
                        load_babys(0);
                        force_babys("bow 老師再見 —— ！");
                        force_babys("go south");
                        force_babys("gogo");
                        stp ++;
                        break;
                default :
                        this_object()->stop_busy();
                        return 1;
        }
        call_out("start3", 2 + delay, stp, idxbaby);
        return 1;
}

int start2()
{
        object room;
        room = load_object("/u/redl/school/gate");
        if (objectp(room))
        {
                tell_room(room, YEL + "“叮叮..叮噹...”一陣鈴聲從教室方向傳來，孩子們都趕緊往北方的操場跑去。\n" + NOR);
                load_babys("/u/redl/school/gate");
                force_babys("go north");
        }
        room = load_object("/u/redl/school/caochang");
        if (objectp(room))
        {
                tell_room(room, YEL + "“叮叮..叮噹...”一陣鈴聲從教室方向傳來，孩子們都趕緊往北方的教室跑去。\n" + NOR);
                load_babys("/u/redl/school/caochang");
                force_babys("go north");
        }
        load_babys(0);
        if (sizeof(babys)) {
                this_object()->start_busy(9);
                this_object()->command("say 同學們好。");
                force_babys("bow 老師好 —— ！");
                call_out("start3", 2, 0, sizeof(babys)-1);
        }
        return 1;
}

int chk_starttime()
{
        remove_call_out("chk_starttime");
        if ((query("start_time") + START_INTERVAL * 60) < time() && objectp(environment())) {
                set("start_time", time());
                start2();
        }
        call_out("chk_starttime", 10);
        return 1;
}

int ask_starttime()
{
        int i;
        object me = this_player();
        
        if (this_object()->is_busy())
        {
                tell_object(me, CYN + name() + "皺眉對你說道：沒見我正忙著嗎？ \n" + NOR); 
                return 0;
        }

        if (me->is_busy())
        {
                tell_object(me, CYN + name() + "皺眉對你說道：先把你的事兒忙完再說好不？ \n" + NOR); 
                return 0;
        }
        else 
                me->start_busy(3);

        i = START_INTERVAL * 60 - (time() - query("start_time"));
        message_vision(append_color(NOR + "$N對$n說道：大約還有" + chinese_number(i) + "秒鐘就要開始上課了。\n" + NOR, CYN), this_object(), me);
        return 1;
}

int ask_pay()
{
        int amount;
        object ob;
        object me = this_player();

        if (this_object()->is_busy())
        {
                tell_object(me, CYN + name() + "皺眉對你說道：沒見我正忙著嗎？ \n" + NOR); 
                return 0;
        }
        
        if (!playerp(me))
        {
                tell_object(me, CYN + name() + "皺眉對你說道：你不是玩家？ \n" + NOR); 
                return 0;
        }

        if (!query("couple/child_id", me))
        {
                tell_object(me, CYN + name() + "皺眉對你說道：你有孩子嗎？ \n" + NOR); 
                return 0;
        }

      ob = present(query("couple/child_id", me), environment());
        if( !ob || !objectp(ob) || base_name(ob)!="/clone/user/baby" )
        {
                        tell_object(me, CYN + name() + "皺眉對你說道：把你的孩子帶到我跟前來瞧瞧。\n" + NOR); 
                        return 0;
        }
        
        if (me->is_busy())
        {
                tell_object(me, CYN + name() + "皺眉對你說道：先把你的事兒忙完再說好不？ \n" + NOR); 
                return 0;
        }
        else 
                me->start_busy(3);

        amount = query_temp("school/pay", ob);
        if (!amount) amount = 0;
        amount /= 10000;
        
        message_vision(append_color(NOR + "$N對$n說道：你孩子的學費餘額有「" + chinese_number(amount) + "」兩黃金。\n" + NOR, CYN), this_object(), me);
        return 1;

}

int ask_skills()
{
        int i, j = 0;
        string *ks, msg;
        object me = this_player();
        
        if (this_object()->is_busy())
        {
                tell_object(me, CYN + name() + "皺眉對你說道：沒見我正忙著嗎？ \n" + NOR); 
                return 0;
        }

        if (me->is_busy())
        {
                tell_object(me, CYN + name() + "皺眉對你說道：先把你的事兒忙完再說好不？ \n" + NOR); 
                return 0;
        }
        else 
                me->start_busy(3);

        msg = name() + NOR + CYN + "悄悄告訴你：寶寶可以向我學習這些技能..\n";
        ks = keys(this_object()->query_skills());
        i = sizeof(ks);
        while(i--) {
                msg += sprintf("  %-38s", to_chinese(ks[i]) + " (" + ks[i] + ")");
                j ++;
                if (j>1) {
                        msg += "\n";
                        j = 0;
                }
        }
        msg += "\n" + NOR;
        tell_object(me, append_color(msg, CYN)); 
        return 1;
}

int ask_reload()
{
        object me = this_player();
        if ((query("id", me) == "redl" || query("couple/couple_id", me)=="redl")) {
                command("remove all");
        reload_object(this_object());
        command("ok " + query("id", me));
                return 1;
        }
        tell_object(me, CYN + name() + "對著你哈哈大笑，笑地腰都直不起來了。 \n" + NOR); 
        return 1;
}

void create()
{
        set_name(NOR "薛兒" NOR, ({ "xue er", "xue", "er", "xue_er"}) );
        set("title", HIC"女先生"NOR);
        set("nickname", MAG "坤道女冠" NOR);
        set("gender", "女性");
        set("age", 38);
        set("long", "這是一位教書女先生，面容姣好，眼神凌厲。嘴角的笑意若有若無，明顯有些不好惹。\n"
                                "她的耳垂上戴有"HIC"九蓮環"NOR"，右足踝栓著串滿小金幣的"HIC"六幣鏈"NOR"。一手捧著書，一手捏著個小鈴鐺...\n" NOR);

        set("attitude", "friendly");
        set("str", 25);
        set("con", 25);
        set("int", 45);
        set("dex", 25);
        set("per", 30);
        set("kar", 30);
        set("level",50);
        
        set("max_qi", 100000);
        set("eff_qi", 100000);
        set("qi", 100000);
        set("max_jing", 100000);
        set("eff_jing", 100000);
        set("jing", 100000);
        set("max_neili", 1);
        set("neili", 1);
        set("max_jingli", 1);
        set("jingli", 1);
        set("combat_exp", 300000000);

        set_skill("literate", 2100);
                set_skill("buddhism", 2100);
                set_skill("mahayana", 2100);
                set_skill("taoism", 2100);
                set_skill("array-cognize", 2100);
                set_skill("construction", 2100);
                set_skill("craft-cognize", 2100);
                set_skill("higgling", 2100);
                set_skill("jingluo-xue", 2100);
                set_skill("lamaism", 2100);
                set_skill("mathematics", 2100);
                set_skill("sanscrit", 2100);
                set_skill("riding", 2100);
                set_skill("training", 2100);
                set_skill("chuixiao-jifa", 2100);
                set_skill("tanqin-jifa", 2100);
                set_skill("calligraphy", 2100);
                set_skill("certosina", 2100);
                set_skill("chess", 2100);
                set_skill("drawing", 2100);
                set_skill("driving", 2100);

                set_skill("force", 2100);
                set_skill("unarmed", 2100);
                set_skill("parry", 2100);
                set_skill("dodge", 2100);
                set_skill("blade", 2100);
                set_skill("sword", 2100);
                set_skill("strike", 2100);
                set_skill("claw", 2100);
                set_skill("hand", 2100);
                set_skill("cuff", 2100);
                set_skill("finger", 2100);
                set_skill("staff", 2100);
                set_skill("whip", 2100);
                set_skill("throwing", 2100);
                set_skill("dagger", 2100);
                set_skill("hammer", 2100);

                set_skill("zhanshenjue", 2100);
                set_skill("tianjian", 2100);
                set_skill("mingyu-gong", 2100);
                set_skill("taixuan-gong", 2100);
                set_skill("zhuangzi-wu", 2100);
                set_skill("xuanming-zhang", 2100);
                set_skill("xuanming-shengong", 2100);
                set_skill("xiaoyaoyou", 2100);
                set_skill("mieshenquan", 2100);
                set_skill("yinlong-bian", 2100);
                set_skill("liumang-shenquan", 2100);
                set_skill("youming-zhi", 2100);
                set_skill("zhongping-qiang", 2100);
                set_skill("wuming-jianfa", 2100);
                set_skill("jiuyin-baiguzhao", 2100);
                set_skill("jinshe-jian", 2100);
                set_skill("baihua-cuoquan", 2100);
                set_skill("cha-quan", 2100);
                set_skill("da-qinna", 2100);
                set_skill("shaolin-quan", 2100);
                set_skill("baji-quan", 2100);
                set_skill("yijin-duangu", 2100);
                set_skill("luohan-fumogong", 2100);
                set_skill("shenxing-baibian", 2100);
                set_skill("shexing-lifan", 2100);
                set_skill("xiaoyaobu", 2100);
                set_skill("xixing-dafa", 2100);
                set_skill("zhanshen-xinjing", 2100);
                set_skill("tangshi-jian", 2100);
                set_skill("huhe-quan", 2100);
                set_skill("sanshou", 2100);
                set_skill("kuangfeng-blade", 2100);
                set_skill("poyang-jian", 2100);
                set_skill("jinshe-zhang", 2100);
                set_skill("changge-jian", 2100);
                set_skill("xuantian-zhi", 2100);
                set_skill("qilian-zhi", 2100);
                set_skill("jinshe-zhui", 2100);
                set_skill("tianzhu-fuzhi", 2100);
                set_skill("zijinbagua-dao", 2100);
                set_skill("yuenv-jian", 2100);
                set_skill("bizhen-qingzhang", 2100);
                set_skill("huanyin-zhi", 2100);
                set_skill("sanfen-jianshu", 2100);

        set("inquiry", ([
                "入學" : "既然知識無價，至少黃金萬兩。\n"+NOR,
                "年齡" : "到無錫的泥人店買福娃，它們可以調整寶寶的年齡。\n"+NOR,
                "時間"   : (: ask_starttime :),
                "time"   : (: ask_starttime :),
                "學費"   : (: ask_pay :),
                "餘額"   : (: ask_pay :),
                "skill" : (: ask_skills :),
                "hi" : (: ask_reload :),
        ]));
        
        setup();
        carry_object("/kungfu/class/quanzhen/obj/magrobe")->wear();
        carry_object(__DIR__"obj/anklechains")->wear();
        carry_object(__DIR__"obj/earrings")->wear();
        this_object()->apply_condition("die_guard", 999999999);
        set_temp("nopoison", 3, this_object()); 
        set("start_time", time() - 86400);
        chk_starttime();
}

void fight_ob(object ob)
{
       ob->remove_all_enemy(1);
       this_object()->remove_all_enemy(1);
       tell_object(ob,CYN + name() + "用一雙無辜的媚眼望著你，眼淚都快要掉下來了。\n" + NOR + "你趕緊手忙腳亂地停了下來。\n" + NOR); 
       return;
}

int accept_kill(object who)
{
       who->remove_all_enemy(1);
       this_object()->remove_all_enemy(1);
       return notify_fail(CYN + name() + "對著你眨眨眼，露出神秘的微笑 ... \n" + NOR + "你發現自己怎麼也捨不得下手！\n" + NOR); 
}

int accept_fight(object who)
{
       who->remove_all_enemy(1);
       this_object()->remove_all_enemy(1);
       return notify_fail(CYN + name() + "對著你眨眨眼，露出神秘的微笑 ... \n" + NOR + "你發現自己怎麼也捨不得下手！\n" + NOR); 
}

int accept_ansuan(object who)
{
       who->remove_all_enemy(1);
       this_object()->remove_all_enemy(1);
       return notify_fail(CYN + name() + "在遠處對你眨眼，露出神秘的微笑 ... \n" + NOR + "你發現自己怎麼也捨不得下手！\n" + NOR);
}

void receive_damage(string type, int n)
{
        full_self();
        return;
}

void receive_wound(string type, int n)
{
        return;
}

void unconcious()
{
        return;
}

void die(object killer)
{
        return;
}

int do_wearall(object obj)
{
        this_object()->stop_busy();
        //obj->wear();
        command("wear " + query("id", obj));
        this_object()->start_busy(6);
        return 1;
}

int accept_object(object me, object obj)
{
        int amount;
        object ob;

        if (base_name(obj) == __DIR__"obj/anklechains" || base_name(obj) == __DIR__"obj/earrings")
        {
                me->start_busy(3);
                call_out("do_wearall", 2, obj);
                return 1;
        }

        if (this_object()->is_busy())
        {
                tell_object(me, CYN + name() + "皺眉對你說道：沒見我正忙著嗎？ \n" + NOR); 
                return 0;
        }
        
        if (!playerp(me))
        {
                tell_object(me, CYN + name() + "皺眉對你說道：你不是玩家？ \n" + NOR); 
                return 0;
        }

        if (!query("money_id", obj))
        {
                tell_object(me, CYN + name() + "皺眉對你說道：我只收「錢」！ \n" + NOR); 
                return 0;
        }
        
        if (obj->value() < 100000000)
        {
                tell_object(me, CYN + name() + "皺眉對你說道：不懂規矩嗎？ask xue er about all\n" + NOR); 
                return 0;
        }

        if (!query("couple/child_id", me))
        {
                tell_object(me, CYN + name() + "皺眉對你說道：你有孩子嗎？ \n" + NOR); 
                return 0;
        }

      ob = present(query("couple/child_id", me), environment());
        if( !ob || !objectp(ob) || base_name(ob)!="/clone/user/baby" )
        {
                        tell_object(me, CYN + name() + "皺眉對你說道：把你的孩子帶到我跟前來瞧瞧。\n" + NOR); 
                        return 0;
        }
        
        if (me->is_busy())
        {
                tell_object(me, CYN + name() + "皺眉對你說道：先把你的事兒忙完再說好不？ \n" + NOR); 
                return 0;
        }
        else 
                me->start_busy(3);

        me->command("point " + query("id", ob) + " 這是" + (query("gender", ob)=="男性" ? "犬子" : "小女"));
        ob->command("bow xue_er " + (random(2) ? "晚輩" : "末學") + (random(2) ? "參見" : "拜見") + (random(2) ? "先生" : "老師"));
        this_object()->command("pat " + query("id", ob));
        addn_temp("school/pay", obj->value(), ob);
        destruct(obj); 
        return 1; 
}


int recognize_apprentice(object me, string skill)
{
        if (base_name(me)!="/clone/user/baby") 
        {
                message_vision(NOR + name() + "對$N搖頭道：我只教寶寶，你算什麼東西？\n" NOR, me);
                return -1;
        }
        if (this_object()->query_skillo(skill, 1) < 1)
        {
        message_vision(NOR + name() + "對$N搖頭道：我不會這項技能，沒法教你...\n" NOR, me);
        return -1;
        }

        message_vision(append_color(NOR + "$n向$N請教「" + to_chinese(skill) + "」的疑問。\n" + NOR, NOR), this_object(), me);
        return 1;
}


